{"sections": {"banner": {"type": "main-collection-banner","disabled": true,"settings": {"show_collection_description": true,"show_collection_image": false,"color_scheme": "scheme-1"}},"product-grid": {"type": "main-collection-product-grid","disabled": true,"settings": {"products_per_page": 16,"columns_desktop": 4,"color_scheme": "scheme-1","image_ratio": "adapt","image_shape": "default","show_secondary_image": false,"show_vendor": false,"show_rating": false,"quick_add": "none","enable_filtering": true,"filter_type": "horizontal","enable_sorting": true,"columns_mobile": "2","padding_top": 36,"padding_bottom": 36}},"main_banner_and_video_HjbmW9": {"type": "main-banner-and-video","disabled": true,"settings": {"padding_top": 0,"padding_bottom": 0,"mob_padding_top": 0,"mob_padding_bottom": 0,"bg": "#ffffff","video_url": "","img": "shopify://shop_images/Website-Banner.jpg"}},"parent_categories_eV4hcJ": {"type": "parent-categories","blocks": {"category_EbUEYC": {"type": "category","settings": {"img": "shopify://shop_images/45_7be6b348-ff24-44e5-baa8-95769a820243.png","title": "45MM","price": "","link": "shopify://collections/apple-watch-series-8-45mm-repair-prices","btn": "View repairs"}},"category_wDRmLb": {"type": "category","settings": {"img": "shopify://shop_images/41_5be0350d-ee76-481a-95b0-4b09c4e3a573.png","title": "41MM","price": "","link": "shopify://collections/apple-watch-series-8-41mm-repair-prices","btn": "View repairs"}}},"block_order": ["category_EbUEYC","category_wDRmLb"],"name": "Parent Categories","settings": {"column_per_row": 4,"padding_top": 50,"padding_bottom": 50,"mob_padding_top": 40,"mob_padding_bottom": 40,"bg": "#ffffff","heading": "Apple Watch Series 8","heading_size": 28,"details": "","btn_link": "","btn_text": ""}},"apple_watch_videos_9hcR7K": {"type": "apple-watch-videos","name": "Apple Watch Videos","settings": {"heading": "Behind the scenes","subtitle": "Watch our videos to understand common repair issues, what to expect, and how we fix your device with care.","video_1_title": "Repair your Watch, don't replace it.","video_2_title": "Treat your rear glass with care.","video_3_title": "We care about sustainability.","color_scheme": "scheme-4","padding_top": 44,"padding_bottom": 80}},"repair_services_nQkwFT": {"type": "repair-services","blocks": {"service_PEi9BF": {"type": "service","settings": {"icon": "shopify://shop_images/Service_icon_Walk-in.png","heading": "Walk-In Service","details": "For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.","btn": "Learn more","link": "shopify://pages/our-services"}},"service_RaggTi": {"type": "service","disabled": true,"settings": {"icon": "shopify://shop_images/Service_icon_Courier.png","heading": "London Courier","details": "We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.","btn": "Learn more","link": ""}},"service_enBGWD": {"type": "service","settings": {"icon": "shopify://shop_images/Service_icon_Delivery.png","heading": "National Courier","details": "We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.","btn": "Learn more","link": "shopify://pages/our-services"}}},"block_order": ["service_PEi9BF","service_RaggTi","service_enBGWD"],"settings": {"padding-top": 50,"padding-bottom": 50,"mob-padding-top": 40,"mob-padding-bottom": 40,"bg": "#ffffff","heading": "Our services","details": "Choose the most convenient service for you"}},"icorrect_faqs_RVk3VL": {"type": "icorrect-faqs","blocks": {"accordion_mCCjdt": {"type": "accordion","settings": {"heading": "How long does an Apple Watch repair take?","sub_head": "<p>Most Apple Watch repairs are completed within three working days.</p><p>If you need your device back sooner, we offer a next-day turnaround for selected repairs through our Express Service. Same-day repair is not possible, as we use a curing process to reseal the watch and retain its liquid resistance. That adhesive takes time to set properly and we don’t cut corners.</p>","alignment": "left"}},"accordion_dgGrWD": {"type": "accordion","settings": {"heading": "What is the difference between a glass-only repair and a full display replacement?","sub_head": "<p>If your Apple Watch still shows a clear display underneath the cracked glass, and the touch is working properly, we can usually complete a glass-only repair. This retains your original display and helps keep costs down.</p><p>If the display has stopped working, shows lines, or the touch response is lost, you’ll need a full display replacement. This includes both the glass and the OLED screen beneath it.</p><p>Not sure which one you need? We’ll confirm as soon as we’ve inspected your watch.</p>","alignment": "left"}},"accordion_jNEQxe": {"type": "accordion","settings": {"heading": "What warranty do you provide on Apple Watch repairs?","sub_head": "<p>All of our Apple Watch repairs come with a two-year warranty covering any fault related to the repair. That includes issues with the glass, touch response, and display.</p><p>We reseal every watch using liquid-resistant adhesive to match the original seal. This helps protect against day-to-day exposure to water, like washing hands or wearing the watch in the shower.</p><p>However, like Apple, we do not cover accidental water damage. If the watch is not locked properly before swimming or diving, water can still get in and this kind of misuse wouldn’t be covered under warranty.</p>","alignment": "left"}},"accordion_wzPFwd": {"type": "accordion","settings": {"heading": "Will my Apple Watch be water resistant after repair?","sub_head": "<p>Yes, we reseal every Apple Watch using liquid-resistant adhesive that’s equivalent to Apple’s original seal. This helps maintain the same level of water resistance your device had before the damage.</p><p>Your watch will be protected for everyday use including hand washing, light rain, or wearing it in the shower. However, no Apple Watch is fully waterproof. Activities like swimming, especially in the sea or at depth, can still allow water in if the watch is not locked properly.</p><p>For best results, we always recommend enabling Water Lock before using your watch in water.</p>","alignment": "left"}},"accordion_PLgEhN": {"type": "accordion","settings": {"heading": "My glass is broken and the touch is not working. Which repair do I need?","sub_head": "<p>If the glass is cracked and the touch is no longer responding, you’ll need a full display replacement.</p><p>This repair includes both the front glass and the OLED display beneath it. It’s the best option when the screen is damaged beyond just the surface layer, and it ensures your Apple Watch is fully functional again.</p><p>We’ll test everything during our intake checks and confirm the exact fault before starting any work.</p>","alignment": "left"}},"accordion_heFyRm": {"type": "accordion","settings": {"heading": "Why are your Watch repair costs cheaper than Apple?","sub_head": "<p>Because at iCorrect we repair. Apple replace.</p><p>At the Apple Store, even for a small fault like cracked glass on an Apple Watch, they’ll replace the entire device with a reconditioned unit and charge you for it. That’s their default process.</p><p>At iCorrect, we fix the actual fault. Whether it’s just the glass or a full display, we repair what’s needed and nothing more. That’s why our prices are often significantly lower, without compromising on quality.</p>","alignment": "left"}},"accordion_7WpxcT": {"type": "accordion","settings": {"heading": "Will Apple Pay still work after repair?","sub_head": "<p>Yes, absolutely.</p><p>We retain the original NFC chip during both glass-only and full display repairs, which means Apple Pay will continue to work exactly as it did before. Your Apple Watch will still pair, sync, and tap-to-pay without any issues.</p>","alignment": "left"}},"accordion_QdhiRR": {"type": "accordion","settings": {"heading": "Will my ECG and heart rate monitor still work after the repair?","sub_head": "<p>Yes, both features will continue to work as normal after your repair.</p><p>We use original parts and follow Apple’s design standards, which means sensors like ECG and the heart rate monitor remain fully functional. We also test these features during our final quality checks to make sure everything is working before we return your watch.</p>","alignment": "left"}},"accordion_xqYCeD": {"type": "accordion","settings": {"heading": "Do you use original parts for Apple Watch repairs?","sub_head": "<p>Yes. Wherever possible, we use original Apple Watch parts that have been carefully disassembled from genuine devices.</p><p>This approach allows us to retain the original quality and functionality, from touch sensitivity to Apple Pay and waterproofing. Every part is inspected, tested, and cleaned before use, so you get the same performance as you would from a brand new component.</p><p>It also helps reduce waste by giving high-quality parts a second life, rather than letting them end up in landfill.</p>","alignment": "left"}},"accordion_xEd8cE": {"type": "accordion","settings": {"heading": "Can you repair Apple Watch logic boards or water damage?","sub_head": "<p>Unfortunately, no. We don’t repair Apple Watch logic boards or water-damaged internal components.</p><p>These types of faults require full board-level replacement, and the cost to complete that type of repair would often outweigh the value of the watch itself. In cases like this, we’ll always be upfront and help you decide whether it’s worth repairing or replacing the device.</p>","alignment": "left"}}},"block_order": ["accordion_mCCjdt","accordion_dgGrWD","accordion_jNEQxe","accordion_wzPFwd","accordion_PLgEhN","accordion_heFyRm","accordion_7WpxcT","accordion_QdhiRR","accordion_xqYCeD","accordion_xEd8cE"],"settings": {"padding-top": 50,"padding-bottom": 75,"mob-padding-top": 40,"mob-padding-bottom": 40,"bg": "#1d1d1f","heading": "FAQs","details": "Learn more about iCorrect, the essential repair services that we offer and the warranties that come with each repair.","txt-clr": "#ffffff"}},"contact_with_map_dXbbDU": {"type": "contact-with-map","settings": {"padding-top": 0,"padding-bottom": 0,"mob-padding-top": 0,"mob-padding-bottom": 0,"bg": "#fafafa","map": "shopify://shop_images/map-img.webp","heading": "Get In Touch","address": "<h3>Address</h3><p>iCorrect 12 Margaret Street Fitzrovia London W1W 8JQ</p>","hours": "<h3>Hours</h3><p>Mon–Thur: 9am–6pm </p><p>Fri: 10am–6pm </p><p>Sat: Closed </p><p>Sun: Closed</p>"}}},"order": ["banner","product-grid","main_banner_and_video_HjbmW9","parent_categories_eV4hcJ","apple_watch_videos_9hcR7K","repair_services_nQkwFT","icorrect_faqs_RVk3VL","contact_with_map_dXbbDU"]}