{"sections":{"banner":{"type":"main-collection-banner","disabled":true,"settings":{"show_collection_description":true,"show_collection_image":false,"color_scheme":"scheme-1"}},"product-grid":{"type":"main-collection-product-grid","disabled":true,"settings":{"products_per_page":16,"columns_desktop":4,"color_scheme":"scheme-1","image_ratio":"adapt","image_shape":"default","show_secondary_image":false,"show_vendor":false,"show_rating":false,"quick_add":"none","enable_filtering":true,"filter_type":"horizontal","enable_sorting":true,"columns_mobile":"2","padding_top":36,"padding_bottom":36}},"main_banner_and_video_HjbmW9":{"type":"main-banner-and-video","disabled":true,"settings":{"padding_top":0,"padding_bottom":0,"mob_padding_top":0,"mob_padding_bottom":0,"bg":"#ffffff","video_url":"","img":"shopify:\/\/shop_images\/Website-Banner.jpg"}},"about_info_RWbQxj":{"type":"about-info","name":"About Info","settings":{"padding_top":50,"padding_bottom":50,"mob_padding_top":40,"mob_padding_bottom":40,"bg":"#fafafa","heading":"iPhone Charging Port Repair Prices","details":"<p>If your iPhone is not charging properly, only powers when the cable is angled, or will not recognise a charger at all, the charging port may be damaged, even if it is just one bent or corroded pin. At iCorrect, we repair iPhone charging ports using original parts and proper calibration, restoring full charging performance.<\/p><p><br\/>Most iPhone charging port repairs are completed the same day. We run a full test beforehand to check whether the fault is the port itself or something deeper in the power circuit. If it is just the port, we replace it with an original part. If the fault runs deeper, we adjust to a full diagnostic and provide a clear repair plan so you know exactly what is wrong and how we can fix it.<\/p>","btn":"","link":"","btn_2":"","link_2":"","heading_size_desktop":38,"heading_size_mobile":24,"heading_line_height_desktop":46,"heading_line_height_mobile":36}},"iphone_model_search_6iiGHm":{"type":"iphone-model-search","name":"iPhone Search & Wizard","settings":{"enable_model_search":true,"model_search_scope_selector":"#product-grid, .product-grid","padding_top":36,"padding_bottom":36,"section_color_scheme":""}},"featured_collection_AfhUDd":{"type":"featured-collection","name":"t:sections.featured-collection.presets.name","settings":{"title":"","heading_size":"h1","description":"","show_description":false,"description_style":"body","collection":"iphone-charging-port-repair-prices","columns_desktop":3,"full_width":false,"show_view_all":true,"view_all_style":"solid","enable_desktop_slider":false,"color_scheme":"scheme-1","image_ratio":"square","image_shape":"default","show_secondary_image":false,"show_vendor":false,"show_rating":false,"quick_add":"none","columns_mobile":"1","swipe_on_mobile":false,"padding_top":36,"padding_bottom":36}},"about_info_XAqnaH":{"type":"about-info","name":"About Info","settings":{"padding_top":50,"padding_bottom":50,"mob_padding_top":40,"mob_padding_bottom":40,"bg":"#fafafa","heading":"Our Process","details":"<p>Your iPhone’s charging port is the first link in its power chain, connecting your charger to the battery and logic board. A damaged port can lead to all sorts of issues: slow charging, overheating, failed backups, or even no power at all.<\/p><p><br\/>At iCorrect, we do not just fit a new port and hope for the best. We inspect the charging system fully, run power draw tests, and confirm the integrity of the surrounding circuit. If we find liquid damage, corrosion, or a logic board fault, we will upgrade to a full diagnostic and let you know exactly what is wrong before going further.<\/p><p><br\/>We believe in repairing the actual problem, not guessing, and always confirm the cost before we proceed.<\/p>","btn":"","link":"","btn_2":"","link_2":"","heading_size_desktop":38,"heading_size_mobile":24,"heading_line_height_desktop":46,"heading_line_height_mobile":36}},"iphone_videos_n4UAUX":{"type":"iphone-videos","name":"iPhone Videos","settings":{"heading":"Behind the scenes","subtitle":"Watch our videos to understand common repair issues, what to expect, and how we fix your device with care.","video_1_title":"We specialise in data recovery.","video_2_title":"Do not compromise on quality.","video_3_title":"Poor quality parts cause serious issues.","color_scheme":"scheme-4","padding_top":44,"padding_bottom":80}},"repair_services_nQkwFT":{"type":"repair-services","blocks":{"service_PEi9BF":{"type":"service","settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Walk-in.png","heading":"Walk-In Service","details":"For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.","btn":"Learn more","link":"shopify:\/\/pages\/our-services"}},"service_RaggTi":{"type":"service","disabled":true,"settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Courier.png","heading":"London Courier","details":"We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.","btn":"Learn more","link":""}},"service_enBGWD":{"type":"service","settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Delivery.png","heading":"National Courier","details":"We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.","btn":"Learn more","link":"shopify:\/\/pages\/our-services"}}},"block_order":["service_PEi9BF","service_RaggTi","service_enBGWD"],"settings":{"padding-top":50,"padding-bottom":50,"mob-padding-top":40,"mob-padding-bottom":40,"bg":"#ffffff","heading":"Our services","details":"Choose the most convenient service for you"}},"icorrect_faqs_RVk3VL":{"type":"icorrect-faqs","blocks":{"accordion_mCCjdt":{"type":"accordion","settings":{"heading":"How does the cost of repairing an iPhone charging port compare to the Apple Store?","sub_head":"<p>Charging port repairs usually cost between £79 and £129, depending on your model and the confirmed fault. If we confirm that the issue is isolated to the port, we will quote and complete the repair the same day.<\/p><p>At the Apple Store, charging port issues often require a full rear housing replacement, which includes the battery and chassis, even if the port is the only fault. This can cost up to £500 depending on the model. You also have to turn off Find My iPhone in case they need to restore your device. With us, there is no hassle, no overcharging, and no unnecessary steps.<\/p><p>If the fault runs deeper, such as damage to the charging IC, which is the chip that manages power delivery from the port to the battery and logic board, or the surrounding circuitry, we will upgrade to a full diagnostic and provide a detailed quote. You will know exactly what is needed and what it will cost before anything goes ahead.<\/p>","alignment":"left"}},"accordion_dgGrWD":{"type":"accordion","settings":{"heading":"How do I know if my charging port needs to be repaired?","sub_head":"<p>Common signs include:<\/p><ul><li>Your iPhone only charges when the cable is angled or pressed in<\/li><li>Charging is slow, stops randomly, or never starts<\/li><li>The phone does not recognise certain cables<\/li><li>The port feels loose or wobbly<\/li><li>Corrosion or dark residue is visible in the port<\/li><li>Your iPhone keeps showing a moisture warning and refuses to charge<\/li><\/ul><p>We test the charging port using known-good cables and a power ammeter to confirm voltage draw. If the port is not the issue, we investigate further and isolate the real cause.<\/p>","alignment":"left"}},"accordion_jNEQxe":{"type":"accordion","settings":{"heading":"Do you use original parts for charging port repairs?","sub_head":"<p> Yes, we only use original Apple charging ports. These are reclaimed from genuine Apple devices and tested in-house to meet factory standards. Every part is tested and verified using proper diagnostic tools, so you get a repair that lasts.<\/p><p>We do not use cheap ports from unknown suppliers. Our replacements are fitted, tested, and verified to ensure a lasting repair.<\/p>","alignment":"left"}},"accordion_wzPFwd":{"type":"accordion","settings":{"heading":"Can a bad charging port damage my iPhone?","sub_head":"<p> Yes. A worn or shorted port can send irregular voltage into your iPhone’s power system, damaging the charging IC or other board components. The charging IC, or integrated circuit, controls how power flows from the port to the battery and logic board. If it fails, you may experience overheating, battery issues, or total power failure.<\/p><p>Replacing a faulty charging port early can help avoid far more expensive repairs later.<\/p>","alignment":"left"}},"accordion_iPyPC6":{"type":"accordion","settings":{"heading":"How long does an iPhone charging port repair take?","sub_head":"<p>Most iPhone charging port repairs are completed the same day. We recommend booking your iPhone in for an appointment to ensure same-day turnaround. If it is just the port, it will be completed within 2 to 3 hours. If your iPhone requires a diagnostic, we will advise you and can quote our turnarounds, which are normally within 24 hours.<\/p><p>Express service is available, but please contact us ahead of time to confirm availability and part compatibility.<\/p>","alignment":"left"}},"accordion_PLgEhN":{"type":"accordion","settings":{"heading":"What if the issue is not the charging port?","sub_head":"<p>We test for that immediately. If the port is receiving and passing power correctly, we upgrade to a full diagnostic and test the charging IC, logic board circuits, and battery system. That way, we confirm exactly what is wrong.<\/p><p>We do not guess or swap parts without reason. You will receive a full report with findings, a repair plan, and a confirmed quote before we continue.<\/p>","alignment":"left"}},"accordion_wMHNen":{"type":"accordion","settings":{"heading":"Is it safe to repair a charging port on an iPhone?","sub_head":"<p>Yes, when completed by trained technicians. We use microscope-level precision tools, anti-static protection, and proper disassembly and reassembly methods for every model.<\/p><p>Our team handles hundreds of iPhone charging faults each month. Your data remains safe, and your device is returned tested and verified.<\/p>","alignment":"left"}},"accordion_heFyRm":{"type":"accordion","settings":{"heading":"What does your warranty cover on charging port repairs?","sub_head":"<p>All charging port repairs come with a two-year warranty covering the port itself and the repair workmanship.<\/p><p>We do not cover accidental damage, liquid ingress, or faults caused by using non-original chargers. But if the port fails, becomes loose, or stops charging properly through normal use, we will replace it free of charge.<\/p>","alignment":"left"}},"accordion_7WpxcT":{"type":"accordion","settings":{"heading":"Can a faulty charger cause damage to the port or iPhone?","sub_head":"<p>Absolutely. Non-original or cheap chargers can deliver unstable power, overheat the port, or trigger power faults on the logic board. If your iPhone started playing up after switching to a new charger, that is often the cause.<\/p><p>We always test your iPhone with verified original Apple cables during intake, so we know where the issue lies.<\/p>","alignment":"left"}},"accordion_LrTg7i":{"type":"accordion","settings":{"heading":"Can you repair an iPhone charging port that has liquid damage?","sub_head":"<p>Yes, but this is handled as a liquid damage diagnostic. If we find signs of corrosion or damage inside the charging port, we will clean, test, and isolate the issue properly.<\/p><p>If the damage affects the surrounding board area, we will let you know what is needed to get your iPhone stable and charging again. Liquid faults often affect more than just the port, so we treat them with extra care.<\/p>","alignment":"left"}}},"block_order":["accordion_mCCjdt","accordion_dgGrWD","accordion_jNEQxe","accordion_wzPFwd","accordion_iPyPC6","accordion_PLgEhN","accordion_wMHNen","accordion_heFyRm","accordion_7WpxcT","accordion_LrTg7i"],"settings":{"padding-top":50,"padding-bottom":75,"mob-padding-top":40,"mob-padding-bottom":40,"bg":"#1d1d1f","heading":"FAQs","details":"Learn more about iCorrect, the essential repair services that we offer and the warranties that come with each repair.","txt-clr":"#ffffff"}},"contact_with_map_dXbbDU":{"type":"contact-with-map","settings":{"address":"<h3>Address<\/h3><p>iCorrect\u202812 Margaret Street\u2028Fitzrovia\u2028London\u2028W1W 8JQ<\/p>"}}},"order":["banner","product-grid","main_banner_and_video_HjbmW9","about_info_RWbQxj","iphone_model_search_6iiGHm","featured_collection_AfhUDd","about_info_XAqnaH","iphone_videos_n4UAUX","repair_services_nQkwFT","icorrect_faqs_RVk3VL","contact_with_map_dXbbDU"]}