{"sections": {"banner": {"type": "main-collection-banner","disabled": true,"settings": {"show_collection_description": true,"show_collection_image": false,"color_scheme": "scheme-1"}},"product-grid": {"type": "main-collection-product-grid","disabled": true,"settings": {"products_per_page": 16,"columns_desktop": 4,"color_scheme": "scheme-1","image_ratio": "adapt","image_shape": "default","show_secondary_image": false,"show_vendor": false,"show_rating": false,"quick_add": "none","enable_filtering": true,"filter_type": "horizontal","enable_sorting": true,"columns_mobile": "2","padding_top": 36,"padding_bottom": 36}},"main_banner_and_video_HjbmW9": {"type": "main-banner-and-video","disabled": true,"settings": {"padding_top": 0,"padding_bottom": 0,"mob_padding_top": 0,"mob_padding_bottom": 0,"bg": "#ffffff","video_url": "","img": "shopify://shop_images/Website-Banner.jpg"}},"about_info_RWbQxj": {"type": "about-info","name": "About Info","settings": {"padding_top": 50,"padding_bottom": 50,"mob_padding_top": 40,"mob_padding_bottom": 40,"bg": "#f1f1f1","heading": "MacBook Screen Repair","details": "<p>If your MacBook screen is cracked, flickering, dim, or completely dead, this is the right place. We’re iCorrect, and we specialise in professional, original screen repairs for MacBook Air and MacBook Pro.</p><p><br/>Unlike most repair shops, we don’t replace the full lid unless we have to. We replace just the broken display using genuine Apple screens that we reclaim, restore, and recalibrate in-house to original factory standards. That means your MacBook keeps features like True Tone, full brightness, and colour accuracy with no downgrade in quality.</p><p><br/>This isn’t a patch job. It’s a proper screen repair carried out by specialists in microelectronics. It’s also why other repair shops come to us when they’re out of their depth, and why insurers and business clients trust us with high-spec MacBook repairs every day.</p>","btn": "","link": "","btn_2": "","link_2": "","heading_size_desktop": 38,"heading_size_mobile": 24,"heading_line_height_desktop": 46,"heading_line_height_mobile": 36}},"model_number_search_LChRtp": {"type": "model-number-search","blocks": {"heading_itGQBd": {"type": "heading","settings": {"heading": "Need help identifying your MacBook?","heading_size": "h1"}},"text_Nxt39C": {"type": "text","settings": {"text": "<p>Check the model number printed on the underside of your MacBook. It starts with the letter “A” followed by four digits. Use this number to quickly identify your exact model and ensure you select the correct repair or service.</p>","text_style": "body"}}},"block_order": ["heading_itGQBd","text_Nxt39C"],"name": "Model Number Search","settings": {"enable_model_search": true,"model_search_placeholder": "Enter model number, e.g. A3403","model_search_button_label": "Search","model_search_mode": "scroll","model_search_scope_selector": "#shopify-section-featured-collection, .featured-collection, .collection","image": "shopify://shop_images/MacBook_Model_Number.png","height": "adapt","desktop_image_width": "small_medium","layout": "image_first","desktop_content_position": "top","desktop_content_alignment": "left","content_layout": "no-overlap","section_color_scheme": "","color_scheme": "","image_behavior": "none","mobile_content_alignment": "left","padding_top": 36,"padding_bottom": 36}},"featured_collection_AfhUDd": {"type": "featured-collection","name": "t:sections.featured-collection.presets.name","settings": {"title": "","heading_size": "h1","description": "","show_description": false,"description_style": "body","collection": "macbook-screen-repair-prices","products_to_show": 3,"columns_desktop": 3,"full_width": false,"show_view_all": false,"view_all_style": "solid","enable_desktop_slider": false,"color_scheme": "scheme-1","image_ratio": "adapt","image_shape": "default","show_secondary_image": false,"show_vendor": false,"show_rating": false,"quick_add": "none","columns_mobile": "1","swipe_on_mobile": false,"padding_top": 36,"padding_bottom": 36}},"macbook_videos_g8MAHm": {"type": "macbook-videos","name": "MacBook Videos","settings": {"heading": "See How We Repair Your MacBook","video_1_title": "Repair is better than replace.","video_2_title": "Our repair approach is sustainable.","video_3_title": "Do not overpay for your repairs.","color_scheme": "scheme-2","padding_top": 40,"padding_bottom": 80}},"about_info_XAqnaH": {"type": "about-info","name": "About Info","settings": {"padding_top": 50,"padding_bottom": 50,"mob_padding_top": 40,"mob_padding_bottom": 40,"bg": "#ffffff","heading": "Our Process","details": "<p>We don’t believe in unnecessary replacements. Where possible, we retain your MacBook’s original housing, webcam, hinge, and lid structure. We replace only the part that’s actually damaged: the display panel.</p><p><br/>Using genuine Apple displays sourced from donor devices, we restore the screen with a perfect fit and recalibrate every display to match factory colour, brightness, and tone. This saves money, preserves your MacBook’s feel and finish, and keeps working components out of landfill.</p><p><br/>Other shops often install full aftermarket lids. We do better. Our approach is cleaner, more sustainable, and simply more Apple-like. Your MacBook deserves that level of care.</p>","btn": "","link": "","btn_2": "","link_2": "","heading_size_desktop": 28,"heading_size_mobile": 24,"heading_line_height_desktop": 46,"heading_line_height_mobile": 36}},"repair_services_nQkwFT": {"type": "repair-services","blocks": {"service_PEi9BF": {"type": "service","settings": {"icon": "shopify://shop_images/Service_icon_Walk-in.png","heading": "Walk-In Service","details": "For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.","btn": "Learn more","link": ""}},"service_RaggTi": {"type": "service","disabled": true,"settings": {"icon": "shopify://shop_images/Service_icon_Courier.png","heading": "London Courier","details": "We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.","btn": "Learn more","link": ""}},"service_enBGWD": {"type": "service","settings": {"icon": "shopify://shop_images/Service_icon_Delivery.png","heading": "National Courier","details": "We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.","btn": "Learn more","link": ""}}},"block_order": ["service_PEi9BF","service_RaggTi","service_enBGWD"],"settings": {"padding-top": 50,"padding-bottom": 50,"mob-padding-top": 40,"mob-padding-bottom": 40,"bg": "#f1f1f1","heading": "Our repair services","details": "Choose the most convenient service for you"}},"macbook_faqs_NM43HR": {"type": "macbook-faqs","blocks": {"accordion_93p49t": {"type": "accordion","settings": {"heading": "How long do MacBook repairs take?","sub_head": "<p>Most MacBook repairs, including screen replacements, battery replacements, and keyboard repairs, take around 3 working days. If you need it done sooner, we offer an express MacBook repair service, allowing next day or same day repairs if booked in advance.</p>","alignment": "left"}},"accordion_Ln6Tp4": {"type": "accordion","settings": {"heading": "What warranty do you offer?","sub_head": "<p>We provide a two year warranty on all MacBook repairs, covering issues related to the repair. Whether it is a screen replacement, battery repair, or logic board fix, our warranty ensures long term reliability. This does not cover accidental damage, but we are happy to help if any new issues arise.</p>","alignment": "left"}},"accordion_m3DhLE": {"type": "accordion","settings": {"heading": "Do you use original parts?","sub_head": "<p>Yes, around 90% of the parts we use are original Apple parts, disassembled from genuine Apple devices. We champion sustainable repairs, and reusing parts helps maintain Apple standards without creating unnecessary waste.</p><p>This approach means your MacBook retains features like True Tone, battery health monitoring, and the overall performance it was designed for after any repair at iCorrect.</p><p>The only exception is with older MacBook models, where it is no longer possible to source original batteries in high capacity condition. In those cases, we use the best quality OEM batteries available.</p>","alignment": "left"}},"accordion_EMwVAE": {"type": "accordion","settings": {"heading": "Do you repair damaged MacBook logic boards?","sub_head": "<p>Yes, this is advanced work we are known for. While many repair centres, including Apple, will write off a faulty logic board and quote a full replacement, we repair them properly.</p><p>Our technicians work under a microscope, diagnosing issues at component and microchip level. That could mean anything from replacing a burned out MOSFET or shorted capacitor to rebuilding complete circuits after liquid damage. We revive boards others declare dead and we do it every day.</p><p>It is precise, delicate work, but it saves clients hundreds compared to Apple, keeps original data intact, and reduces electronic waste.</p><p>If Apple said your MacBook is not fixable and that you need a new one, there is a good chance we will prove them wrong.</p>","alignment": "left"}},"accordion_6LNXQt": {"type": "accordion","settings": {"heading": "What if my MacBook repair does not resolve the issue?","sub_head": "<p>It is rare, but if a repair does not fully resolve the problem your MacBook has, we will not charge you for it. Our no fix, no fee policy applies to all standard MacBook repairs, and we will always explain what went wrong and what your options are.</p><p>In more advanced logic board diagnostics, if we are unsuccessful, we will suggest an alternative like a logic board replacement or data recovery, depending on what we find.</p><p>Either way, you will get a clear answer, not guesswork. No surprises.</p>","alignment": "left"}},"accordion_tjJ7Ua": {"type": "accordion","settings": {"heading": "Can I get my MacBook repaired quicker?","sub_head": "<p>Yes, we offer an Express MacBook Repair Service for clients who need a faster turnaround. This service is limited and subject to availability, so booking in advance is recommended.</p><p>When pre booked, express repairs are often completed within one working day, and in some cases, even the same day. This applies to most issues, including screen, battery, and logic board repairs. Express bookings are prioritised and priced accordingly.</p>","alignment": "left"}},"accordion_fELtWi": {"type": "accordion","settings": {"heading": "What is your diagnostic process for MacBook repairs?","sub_head": "<p>Diagnostics are where we do our best thinking. If the fault is not obvious, we run a full diagnostic on your MacBook, going deep into the logic board, charging system, and internal circuitry.</p><p>We perform a full power rail test and visual inspection under a microscope, looking for signs of damage at component level. That includes blown capacitors, corroded traces, and shorted chips. We then test each critical stage of the board to narrow down the fault.</p><p>Once we confirm the issue, we send a detailed report with a clear repair plan and quote so you are fully informed before any work begins.</p>","alignment": "left"}},"accordion_Fy7b4E": {"type": "accordion","settings": {"heading": "Do you offer payment plans for MacBook repairs?","sub_head": "<p>Yes, we offer flexible payment options through Klarna and PayPal Pay in 3. These let you spread the cost of your MacBook repair over time.</p><p>Both options are available at checkout for standard repairs. If you are sending your MacBook in for diagnostics, we will include the payment options with your quote once your MacBook repair plan is confirmed.</p>","alignment": "left"}},"accordion_keBNzJ": {"type": "accordion","settings": {"heading": "How do you ensure the quality of your MacBook repairs?","sub_head": "<p>Every MacBook goes through multiple rounds of testing to make sure the repair is done right.</p><p>When a device arrives, we carry out a full intake check before it reaches the repair team. Once the repair begins, we run pre checks to confirm the fault and rule out any secondary issues. After the repair, your MacBook goes through full post repair testing and a final quality check completed by a technician who was not involved in the repair itself.</p><p>We also invest in ongoing training, and our technicians develop solutions for the latest MacBook issues, including faults Apple has not published repair procedures for yet.</p>","alignment": "left"}},"accordion_ztWfAg": {"type": "accordion","settings": {"heading": "Do you repair older MacBook models?","sub_head": "<p>We mainly repair MacBook models from 2016 onwards, including both MacBook Air and MacBook Pro. For older models, especially those from 2015 and before, we can still help with things like battery replacements or data recovery.</p><p>We will be upfront if a repair does not make financial sense. If the cost outweighs the value of the device, we will recommend a more practical option.</p>","alignment": "left"}}},"block_order": ["accordion_93p49t","accordion_Ln6Tp4","accordion_m3DhLE","accordion_EMwVAE","accordion_6LNXQt","accordion_tjJ7Ua","accordion_fELtWi","accordion_Fy7b4E","accordion_keBNzJ","accordion_ztWfAg"],"name": "MacBook FAQs","settings": {"padding-top": 50,"padding-bottom": 50,"mob-padding-top": 40,"mob-padding-bottom": 40,"bg": "#1d1d1f","heading": "FAQs","details": "Learn more about our MacBook repair service, parts, diagnostics, turnaround times, and warranty.","txt-clr": "#ffffff"}},"icorrect_faqs_RVk3VL": {"type": "icorrect-faqs","blocks": {"accordion_mCCjdt": {"type": "accordion","settings": {"heading": "How much does a MacBook screen repair cost compared to the Apple Store? ","sub_head": "<p>Apple charges between £500 and £900 for a MacBook screen repair because they replace the entire lid assembly. That includes the display, casing, hinges, camera, and wireless antenna, even if none of those parts are damaged.</p><p>We take a different approach. We replace only the damaged display, using an original Apple screen recovered from a donor device. This lets us retain your MacBook's original lid, camera, and housing. Our repairs cost 30 to 50 percent less than Apple and are completed faster.</p><p>You may see cheaper prices online, but those typically involve aftermarket parts. These parts often cause True Tone and brightness issues, and the housing rarely fits properly. Our repairs avoid those problems and deliver the same quality as Apple, without the Apple tax.</p>","alignment": "left"}},"accordion_dgGrWD": {"type": "accordion","settings": {"heading": "Do you use Apple screens in your MacBook repairs?","sub_head": "<p>Yes. We use original Apple displays reclaimed from genuine MacBooks. Every screen is tested and recalibrated to match Apple factory specifications.</p><p>We never use aftermarket panels. The colour, brightness, and tone of an Apple display are built into the hardware and software working together. That is why we only use parts that retain full compatibility with Apple firmware.</p>","alignment": "left"}},"accordion_jNEQxe": {"type": "accordion","settings": {"heading": "Will my screen repair with iCorrect void my Apple warranty?","sub_head": "<p>If your screen is already damaged, your Apple warranty is technically void. Apple does not repair MacBook screens. They only replace full lids or offer full device swaps.</p><p>Our repairs restore your MacBook with an original screen and do not cause software conflicts. But Apple may still decline future warranty service simply because a third party has handled the device. This is out of our control.</p><p>That said, you are getting the same screen, fitted to a higher standard, in less time, at significantly less cost. And your repair is covered by our own two-year warranty.</p>","alignment": "left"}},"accordion_wzPFwd": {"type": "accordion","settings": {"heading": "Will I keep True Tone and other features after the screen is replaced?","sub_head": "<p>Yes. We only use Apple displays, so your MacBook will retain True Tone, full brightness, native resolution, colour calibration, and ambient light features.</p><p>Every screen we install is tested and calibrated to preserve all visual features and system-level functions. We also verify performance during our final quality control inspection.</p>","alignment": "left"}},"accordion_iPyPC6": {"type": "accordion","settings": {"heading": "Will it be obvious that my MacBook screen has been repaired?","sub_head": "<p>Not at all. If we’ve done our job right, and we do, your MacBook will look exactly like it did before it broke.</p><p>There will be no scratches, no marks, no strange colours, no signs of tampering. Just a clean, sharp, perfectly aligned display. We use Apple screens and precision tools to make sure the fit and finish are flawless.</p>","alignment": "left"}},"accordion_PLgEhN": {"type": "accordion","settings": {"heading": "How long does a MacBook screen repair take?","sub_head": "<p>Standard screen repairs take two to three working days. That includes intake checks, disassembly, display prep, fitting, calibration, post-repair testing, and final QC.</p><p>Need it faster? Book our express service. It reduces turnaround to one working day when scheduled in advance.</p><p>We can offer this because we’ve built an assembly-line workflow. Each stage is handled by a dedicated technician, which speeds up the process without sacrificing quality.</p>","alignment": "left"}},"accordion_wMHNen": {"type": "accordion","settings": {"heading": "What if the screen isn’t the only issue, will you check for other damage?","sub_head": "<p>Yes. We always check for deeper faults before we begin any screen repair. If your MacBook does not power on or show a display, we upgrade the job to a full diagnostic first.</p><p>This lets us identify power issues, logic board damage, or other faults that may not be visible at first glance. We’ll tell you exactly what’s wrong before proceeding, with a clear quote and no surprises.</p>","alignment": "left"}},"accordion_heFyRm": {"type": "accordion","settings": {"heading": "Can you repair Liquid Retina XDR or other high-spec MacBook screens?","sub_head": "<p>Yes. We handle all screen types including Liquid Retina XDR on 14-inch and 16-inch MacBook Pros.</p><p>These displays require greater precision due to their mini-LED structure and calibration demands. Our team is trained in handling them correctly and restoring them with genuine Apple parts.</p>","alignment": "left"}},"accordion_7WpxcT": {"type": "accordion","settings": {"heading": "How is your MacBook screen repair sustainable? How do you reuse parts?","sub_head": "<p>We recover and refurbish original Apple displays from genuine MacBooks. These displays are fully tested, cleaned, recalibrated, and reused when they meet factory performance standards.</p><p>Instead of replacing the whole lid, we preserve the casing, webcam, and hinge, cutting down on e-waste. Every part that can be kept in use is kept in use.</p><p>This approach reduces environmental impact and makes each repair more affordable. It is sustainability without compromise.</p>","alignment": "left"}},"accordion_7BMWPU": {"type": "accordion","settings": {"heading": "What if I’ve already had my MacBook screen repaired elsewhere and it’s still faulty?","sub_head": "<p>We deal with these cases often. Poor third-party repairs often use full lids with non-original screens, leading to dim displays, missing features, and poor fit.</p><p>If we detect aftermarket parts or incompatible assemblies, we’ll let you know. In many cases, we can replace the faulty screen with an original one and restore your MacBook to full health.</p><p>We’ll explain what went wrong with your previous repair and what can be done to fix it properly. If a housing or internal parts need to be replaced too, we’ll give you the full picture and a clear quote before we begin.</p>","alignment": "left"}}},"block_order": ["accordion_mCCjdt","accordion_dgGrWD","accordion_jNEQxe","accordion_wzPFwd","accordion_iPyPC6","accordion_PLgEhN","accordion_wMHNen","accordion_heFyRm","accordion_7WpxcT","accordion_7BMWPU"],"disabled": true,"settings": {"padding-top": 50,"padding-bottom": 75,"mob-padding-top": 40,"mob-padding-bottom": 40,"bg": "#1d1d1f","heading": "FAQs","details": "Learn more about iCorrect, the essential repair services that we offer and the warranties that come with each repair.","txt-clr": "#ffffff"}},"contact_with_map_dXbbDU": {"type": "contact-with-map","settings": {"padding-top": 0,"padding-bottom": 0,"mob-padding-top": 0,"mob-padding-bottom": 0,"bg": "#fafafa","map": "shopify://shop_images/map-img.webp","heading": "Get In Touch","address": "<h3>Address</h3><p>iCorrect 12 Margaret Street Fitzrovia London W1W 8JQ</p>","hours": "<h3>Hours</h3><p>Mon–Thur: 9am–6pm </p><p>Fri: 10am–6pm </p><p>Sat: Closed </p><p>Sun: Closed</p>"}}},"order": ["banner","product-grid","main_banner_and_video_HjbmW9","about_info_RWbQxj","model_number_search_LChRtp","featured_collection_AfhUDd","macbook_videos_g8MAHm","about_info_XAqnaH","repair_services_nQkwFT","macbook_faqs_NM43HR","icorrect_faqs_RVk3VL","contact_with_map_dXbbDU"]}