{"sections":{"banner":{"type":"main-collection-banner","disabled":true,"settings":{"show_collection_description":true,"show_collection_image":false,"color_scheme":"scheme-1"}},"product-grid":{"type":"main-collection-product-grid","disabled":true,"settings":{"products_per_page":16,"columns_desktop":4,"color_scheme":"scheme-1","image_ratio":"adapt","image_shape":"default","show_secondary_image":false,"show_vendor":false,"show_rating":false,"quick_add":"none","enable_filtering":true,"filter_type":"horizontal","enable_sorting":true,"columns_mobile":"2","padding_top":36,"padding_bottom":36}},"main_banner_and_video_HjbmW9":{"type":"main-banner-and-video","disabled":true,"settings":{"padding_top":0,"padding_bottom":0,"mob_padding_top":0,"mob_padding_bottom":0,"bg":"#ffffff","video_url":"","img":"shopify:\/\/shop_images\/Website-Banner.jpg"}},"about_info_RWbQxj":{"type":"about-info","name":"About Info","settings":{"padding_top":50,"padding_bottom":50,"mob_padding_top":40,"mob_padding_bottom":40,"bg":"#ffffff","heading":"iPhone Screen Repair Prices","details":"<p>If your iPhone screen is cracked, flickering, or completely dead, you’re in the right place. At iCorrect, we replace screens using original Apple OLED displays that we’ve reclaimed, tested, and calibrated in-house. This means you get the same screen your iPhone shipped with, not a cheap copy, not a second-best replacement.<\/p><p><br\/>Apple will quote you anything from £289 to £429 depending on the model. We complete the same repair using original parts, often for up to 50 percent less.  It’s done in a few hours, not a few days. <\/p><p><br\/>Want a more affordable option? We offer a soft OLED aftermarket screen too, better than most and tested by us. But if you want it exactly like it was, original is definitely the way to go.<\/p>","btn":"","link":"","btn_2":"","link_2":"","heading_size_desktop":38,"heading_size_mobile":24,"heading_line_height_desktop":46,"heading_line_height_mobile":36}},"iphone_model_search_CW4mA7":{"type":"iphone-model-search","blocks":{"heading_4dccQp":{"type":"heading","settings":{"heading":"Identify your iPhone"}},"text_GgKX9P":{"type":"text","settings":{"text":"<p>Search by model number or use our visual guide.<\/p>"}}},"block_order":["heading_4dccQp","text_GgKX9P"],"name":"iPhone Model Finder","settings":{"enable_model_search":true,"model_search_scope_selector":"#shopify-section-featured-collection, .collection, .product-grid","padding_top":36,"padding_bottom":36,"section_color_scheme":""}},"featured_collection_AfhUDd":{"type":"featured-collection","name":"t:sections.featured-collection.presets.name","settings":{"title":"","heading_size":"h1","description":"","show_description":false,"description_style":"body","collection":"iphone-screen-repair-prices","columns_desktop":3,"full_width":false,"show_view_all":false,"view_all_style":"solid","enable_desktop_slider":false,"color_scheme":"scheme-1","image_ratio":"adapt","image_shape":"default","show_secondary_image":false,"show_vendor":false,"show_rating":false,"quick_add":"none","columns_mobile":"1","swipe_on_mobile":false,"padding_top":36,"padding_bottom":36}},"about_info_XAqnaH":{"type":"about-info","name":"About Info","settings":{"padding_top":50,"padding_bottom":50,"mob_padding_top":40,"mob_padding_bottom":40,"bg":"#fafafa","heading":"Our Process","details":"<p>Most repair shops don’t use original iPhone screens. They don’t because they’re expensive, so most choose to fit the cheapest possible screens. We don’t cut corners. We use originals, properly sourced and properly tested. We strip them from genuine devices that were written off by insurance companies for something else. We test every part in-house, clean it, calibrate it, and refit it like new.<\/p><p><br\/>That’s how we can keep quality high and costs to an acceptable level. It’s a far more sustainable way to repair. No landfill, no e-waste, just smart reuse. We also offer a high-quality soft OLED aftermarket screen if you’re on a tighter budget. But we don’t touch LCDs, hard OLEDs, or anything that wrecks the look and feel of your iPhone.<\/p><p><br\/>Every screen we fit goes through pre-repair checks, post-repair checks, and a final sign-off before it leaves the bench. If it’s not perfect, it doesn’t leave. Simple as that.<\/p>","btn":"","link":"","btn_2":"","link_2":"","heading_size_desktop":38,"heading_size_mobile":24,"heading_line_height_desktop":46,"heading_line_height_mobile":36}},"iphone_videos_Ngr6mx":{"type":"iphone-videos","name":"iPhone Videos","settings":{"heading":"See How We Repair Your iPhone","subtitle":"Watch our videos to understand common repair issues, what to expect, and how we fix your device with care.","video_1_title":"We specialise in data recovery.","video_2_title":"Do not compromise on quality.","video_3_title":"Poor quality parts cause serious issues.","color_scheme":"scheme-4","padding_top":44,"padding_bottom":80}},"repair_services_nQkwFT":{"type":"repair-services","blocks":{"service_PEi9BF":{"type":"service","settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Walk-in.png","heading":"Walk-In Service","details":"For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.","btn":"Learn more","link":"shopify:\/\/pages\/our-services"}},"service_RaggTi":{"type":"service","disabled":true,"settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Courier.png","heading":"London Courier","details":"We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.","btn":"Learn more","link":""}},"service_enBGWD":{"type":"service","settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Delivery.png","heading":"National Courier","details":"We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.","btn":"Learn more","link":"shopify:\/\/pages\/our-services"}}},"block_order":["service_PEi9BF","service_RaggTi","service_enBGWD"],"settings":{"padding-top":50,"padding-bottom":50,"mob-padding-top":40,"mob-padding-bottom":40,"bg":"#ffffff","heading":"Our services","details":"Choose the most convenient service for you"}},"video_reviews_83ReMa":{"type":"video-reviews","blocks":{"video_W74UiU":{"type":"video","settings":{"video":"","img":"shopify:\/\/shop_images\/Rectangle_2282.webp"}},"video_XGqbiC":{"type":"video","settings":{"video":"","img":"shopify:\/\/shop_images\/Rectangle_2284.webp"}},"video_weLpfR":{"type":"video","settings":{"video":"","img":"shopify:\/\/shop_images\/Rectangle_2283.webp"}}},"block_order":["video_W74UiU","video_XGqbiC","video_weLpfR"],"disabled":true,"settings":{"padding-top":80,"padding-bottom":80,"mob-padding-top":40,"mob-padding-bottom":80,"bg":"#121212","heading":"See what our clients have to say about us","facebook":"","facebook-icon":"shopify:\/\/shop_images\/fb-icon.png","insta":"","insta-icon":"shopify:\/\/shop_images\/insta-icon.png","tiktok":"","tiktok-icon":"shopify:\/\/shop_images\/tik-icon.png","youtube":"","youtube-icon":"shopify:\/\/shop_images\/utube-icon.png"}},"iphone_faqs_D7xf9k":{"type":"iphone-faqs","blocks":{"accordion_zPT6HC":{"type":"accordion","settings":{"heading":"How long do iPhone repairs take?","sub_head":"<p>Most iPhone repairs are completed within 4 hours. That includes common faults like screen repairs, battery replacements, charging issues, and back glass damage.<\/p><p>If you’re in a rush, we offer an express service that can have your repair completed in as little as 1 to 2 hours. This is subject to availability, so we always recommend booking in advance.<\/p>","alignment":"left"}},"accordion_pwPDrT":{"type":"accordion","settings":{"heading":"What warranty do you offer on iPhone repairs?","sub_head":"<p>All of our iPhone repairs come with a two-year warranty covering any faults related to the repair. Whether it’s a screen replacement, battery repair, or logic board issue, we stand by the quality of our work.<\/p><p>The warranty doesn’t cover accidental damage or natural wear and tear, but if anything goes wrong due to the original fault, our team will sort it.<\/p>","alignment":"left"}},"accordion_GUVXQ8":{"type":"accordion","settings":{"heading":"Do you use original parts?","sub_head":"<p>Yes, we use original Apple parts for all iPhone repairs wherever possible. Most of our parts are carefully reclaimed from genuine Apple devices and tested in-house to confirm full functionality. If there’s any sign of wear or damage, we refurbish the part back to the original factory standard before using it in a repair.<\/p><p>This approach means your iPhone keeps key features like True Tone, battery health tracking, and long-term performance with no compatibility issues or feature loss.<\/p><p>We also believe this is the most sustainable way to repair. By reusing and refurbishing original Apple components, we avoid adding to the growing pile of electronic waste caused by unnecessary replacements. It’s a better outcome for your device, and a smarter one for the planet.<\/p>","alignment":"left"}},"accordion_wWCxW7":{"type":"accordion","settings":{"heading":"Will my iPhone show a “non-genuine” message after screen repair?","sub_head":"<p>No, on devices running iOS 18 or later, we’re able to calibrate the screen directly through the settings so it’s recognised as a verified part. The iPhone just needs to be updated to the latest version of iOS.<\/p>","alignment":"left"}},"accordion_7m4PX4":{"type":"accordion","settings":{"heading":"Can you repair iPhone logic boards?","sub_head":"<p>Yes. This is one of our specialties. Logic board faults are often written off as unrepairable, especially by Apple and most high street repair shops. We take a different approach.<\/p><p>Our technicians work under a microscope at microchip level, repairing faults like power failures, charging issues, and internal connection damage. These issues often happen when the iPhone is dropped and the two layers of the logic board start to separate.<\/p><p>If your iPhone is not powering on, not charging, or has been declared “dead” by another repair centre, there’s still a good chance we can bring it back to life.<\/p>","alignment":"left"}},"accordion_YgMGLU":{"type":"accordion","settings":{"heading":"Will battery health still show in settings after replacement?","sub_head":"<p>Yes. All of our iPhone battery replacements support battery health monitoring in settings, so you can continue to track the performance and condition of your battery over time.<\/p><p>If we install a genuine Apple battery, your iPhone will recognise it as original, and you’ll see a message confirming the part as verified. On models where a genuine battery is no longer available, we use high-quality OEM replacements. These still show battery health in settings, but the message may not include Apple’s verification tag.<\/p><p>We’ll always tell you exactly what battery is being used and why. We only fit batteries that we’ve tested and approved, and we never use cheap or unstable parts that could cause long-term issues.<\/p>","alignment":"left"}},"accordion_eMJKGE":{"type":"accordion","settings":{"heading":"Can you replace just the back glass on an iPhone?","sub_head":"<p>It depends on the model. For iPhone 15 and newer (and also the iPhone 14 and 14 Plus), the back glass is modular. This makes it far more repair-friendly, and we can replace just the glass using a genuine part.<\/p><p>However, for most earlier models, including the iPhone 14 Pro and anything before it, the rear glass is fused to the frame. In these cases, the entire housing needs to be replaced to maintain structural integrity, wireless charging alignment, and proper waterproofing.<\/p><p>You may have seen cheaper back glass-only repairs offered for these older models, but the quality is poor and they tend to crack easily. It is always best to have an original part fitted, even if that means replacing the full housing.<\/p>","alignment":"left"}},"accordion_DCaqFk":{"type":"accordion","settings":{"heading":"Do you need my passcode for testing?","sub_head":"<p>Yes, we do ask for your passcode so we can carry out full pre-repair and post-repair testing. This helps us check functions like Face ID, the camera, speaker, microphone, touchscreen response, and other key features before we return your device.<\/p><p>We do not access any personal apps, banking information, or private content. Our only goal is to confirm that everything is working as it should once the repair is complete.<\/p><p>If you prefer not to share your passcode, we can still carry out the repair. However, we will not be able to test the device fully, and in that case, the warranty will be limited to 30 days rather than our full two-year cover.<\/p>","alignment":"left"}},"accordion_8yeb9n":{"type":"accordion","settings":{"heading":"What’s included in your diagnostic process for iPhones?","sub_head":"<p>If the fault is not obvious, we run a full diagnostic on your iPhone to work out exactly what has gone wrong. This includes checking power flow, charging function, logic board health, and all key components like the screen, battery, microphone, speakers, and sensors.<\/p><p>For more complex issues, especially those related to logic board damage, we inspect the board under a microscope and test individual circuits and chips to identify faults at microchip level.<\/p><p>Once we have confirmed the issue, we will send you a detailed report with a recommended repair plan and quote, so you know exactly what to expect before any work begins.<\/p>","alignment":"left"}}},"block_order":["accordion_zPT6HC","accordion_pwPDrT","accordion_GUVXQ8","accordion_wWCxW7","accordion_7m4PX4","accordion_YgMGLU","accordion_eMJKGE","accordion_DCaqFk","accordion_8yeb9n"],"name":"iPhone FAQs","settings":{"padding-top":50,"padding-bottom":50,"mob-padding-top":40,"mob-padding-bottom":40,"bg":"#1D1D1F","heading":"FAQs","details":"Learn more about iCorrect, the essential iPhone repair services we offer and the warranties that come with each repair.","txt-clr":"#FFFFFF"}},"icorrect_faqs_RVk3VL":{"type":"icorrect-faqs","blocks":{"accordion_mCCjdt":{"type":"accordion","settings":{"heading":"How much does an iPhone screen repair cost compared to the Apple Store?","sub_head":"<p>Our screen repairs can be anywhere from 20 to 50 percent cheaper than the Apple Store, depending on your model. The difference? We repair the actual fault, using a reclaimed original screen. <\/p><p>You’ll get the same screen, same brightness, same colour, same touch response but without the premium price tag. We also offer a budget-friendly option using high-grade soft OLED screens that still look and feel great. But we’ll always be honest about the difference, and you decide from there.<\/p>","alignment":"left"}},"accordion_dgGrWD":{"type":"accordion","settings":{"heading":"How do you source your iPhone screens?","sub_head":"<p>We buy damaged iPhones that have been declared unrepairable, logic board faults, dead batteries. They’re sourced from insurance providers, who have chosen to replace the iPhone rather than repairing. The screens of these iPhones are still perfect. We strip them, test them, clean them, recalibrate them, and reuse them.<\/p><p>It’s better for the planet and better for your wallet. Plus, it means we’re offering a proper Apple screen without the Apple markup. We think that’s how repair should be done. We believe all repairs will be completed with the re-use of parts in the future. It makes for a more sustainable world.<\/p>","alignment":"left"}},"accordion_jNEQxe":{"type":"accordion","settings":{"heading":"What’s the difference between a genuine and an aftermarket iPhone screen?","sub_head":"<p>A genuine screen is the real thing. Soft OLED, factory-calibrated, True Tone-ready. An aftermarket screen might look similar, but the brightness, colour accuracy, and touch feel won’t be quite the same.<\/p><p>We only offer soft OLED aftermarkets, which are close in quality. We do not fit LCDs or hard OLEDs; they’re cheap, drain your battery, and the image always looks wrong. It’s like swapping your flatscreen TV for an old one with a huge back. It works, but you’ll never be happy with it.<\/p><p>If you want it as it was, go genuine. If you’re on a tighter budget, we’ll still give you the best possible alternative  and we’ll be upfront about the difference.<\/p>","alignment":"left"}},"accordion_wzPFwd":{"type":"accordion","settings":{"heading":"Will I lose Face ID, True Tone, or Apple Pay after the screen repair?","sub_head":"<p>No. We test everything before and after the repair. Face ID, Apple Pay, and True Tone all work as they should.<\/p><p>With genuine screens, we calibrate them using Apple’s own system, so your phone recognises the screen as original. With aftermarket screens, the iPhone might show a message saying the screen can’t be verified. That doesn’t mean anything’s broken. It’s just Apple being Apple. We don’t spoof serials. We do things properly.<\/p>","alignment":"left"}},"accordion_iPyPC6":{"type":"accordion","settings":{"heading":"Do you recommend original or aftermarket screens?","sub_head":"<p>We always recommend original, because nothing else feels the same. You’ll get better colour, smoother brightness transitions, better long-term performance, and zero compromise on features.<\/p><p>That said, if your budget doesn’t stretch to an original screen, we’ve got a strong alternative ready. Our soft OLED aftermarket option is still excellent. We avoid LCDs altogether, they’re cheap, poorly built, and cause more issues than they solve. No flickering, no dullness, no overheating issues, no corner-cutting. We’ve tested every option out there and only offer what we’d fit to our own phones.<\/p><p>You decide what’s right for you. We’ll make sure it’s done right either way.<\/p>","alignment":"left"}},"accordion_PLgEhN":{"type":"accordion","settings":{"heading":"Is the screen as strong and responsive as the original?","sub_head":"<p>If you go with an Original screen, it’s exactly the same. It’s reclaimed, cleaned, tested and recalibrated in-house to the same standard. The strength, touch feel, and display response are indistinguishable from a factory-fitted screen.<\/p><p>Our soft OLED aftermarket option is the closest thing you’ll get without using Apple’s parts. It’s strong, responsive, and holds up well, but we’ll always be clear that it’s not quite the same.<\/p>","alignment":"left"}},"accordion_wMHNen":{"type":"accordion","settings":{"heading":"What does your warranty cover on an iPhone screen after repair?","sub_head":"<p>We cover the repair we complete and the part we’ve fitted. Our two-year warranty covers screen faults like failed touch, ghost touches, flickering, or blackouts, basically anything that’s not your fault.<\/p><p>We don’t cover accidental damage. So if you drop your phone or smash the screen again, that would be an insurance issue, not a warranty claim. But if the part fails without damage, we’ll put it right.<\/p>","alignment":"left"}},"accordion_heFyRm":{"type":"accordion","settings":{"heading":"Can I still use Apple Pay and Face ID after the screen is replaced?","sub_head":"<p>Yes. All features continue to work exactly as they should. Apple Pay, Face ID, True Tone, tap-to-wake, every feature you currently have on your iPhone.<\/p><p>We do pre-repair checks, post-repair checks, and a final round of quality control before your device gets back to you. No guesswork. No shortcuts. Just a properly tested iPhone after an iCorrect standard of repair.<\/p>","alignment":"left"}},"accordion_7WpxcT":{"type":"accordion","settings":{"heading":"What if my screen was replaced before and the colours look wrong?","sub_head":"<p>That’s probably an LCD or a hard OLED screen. It’s one of the most common complaints we hear from clients who’ve had repairs elsewhere are dull colours, poor contrast, laggy touch response, or flickering.<\/p><p>We’ll replace it with either a Original screen or one of our premium soft OLEDs. As soon as you see it, you’ll know what your iPhone screen is supposed to look like. Rich colours, deep blacks, sharp response, all back to factory quality. The difference is night and day. We test everything before and after the repair. Face ID, Apple Pay, and True Tone all work as they should.<\/p><p>With genuine screens, we calibrate them using Apple’s own system, so your phone recognises the screen as original. With aftermarket screens, the iPhone might show a message saying the screen can’t be verified. That doesn’t mean anything’s broken. it’s just Apple being Apple. We don’t spoof serials. We do things properly.<\/p>","alignment":"left"}}},"block_order":["accordion_mCCjdt","accordion_dgGrWD","accordion_jNEQxe","accordion_wzPFwd","accordion_iPyPC6","accordion_PLgEhN","accordion_wMHNen","accordion_heFyRm","accordion_7WpxcT"],"disabled":true,"settings":{"padding-top":50,"padding-bottom":75,"mob-padding-top":40,"mob-padding-bottom":40,"bg":"#1d1d1f","heading":"FAQs","details":"Learn more about iCorrect, the essential repair services that we offer and the warranties that come with each repair.","txt-clr":"#ffffff"}},"contact_with_map_dXbbDU":{"type":"contact-with-map","settings":{"map_html":"<iframe src=\"https:\/\/www.google.com\/maps\/embed?pb=!1m18!1m12!1m3!1d2482.7925117760165!2d-0.1422392230845079!3d51.51702250999988!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x48761b2c5aabf83b%3A0x2abbd489a9d66382!2siCorrect!5e0!3m2!1sen!2sit!4v1766495755523!5m2!1sen!2sit\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"><\/iframe>","address":"<h3>Address<\/h3><p>iCorrect\u202812 Margaret Street\u2028Fitzrovia\u2028London\u2028W1W 8JQ<\/p>","form_heading":"Get in Touch","form_subtitle":"Have a question about your device repair? We're here to help.","section_bg":"#f4f4f4","accent_color":"#3b82f6","text_color":"#171717","muted_text_color":"#6b7280","input_bg":"#ffffff","input_border":"#e5e7eb"}}},"order":["banner","product-grid","main_banner_and_video_HjbmW9","about_info_RWbQxj","iphone_model_search_CW4mA7","featured_collection_AfhUDd","about_info_XAqnaH","iphone_videos_Ngr6mx","repair_services_nQkwFT","video_reviews_83ReMa","iphone_faqs_D7xf9k","icorrect_faqs_RVk3VL","contact_with_map_dXbbDU"]}