/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "banner": {
      "type": "main-collection-banner",
      "disabled": true,
      "settings": {
        "show_collection_description": false,
        "show_collection_image": false,
        "color_scheme": "scheme-1"
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "disabled": true,
      "settings": {
        "products_per_page": 16,
        "columns_desktop": 4,
        "color_scheme": "scheme-1",
        "image_ratio": "adapt",
        "image_shape": "default",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": false,
        "quick_add": "none",
        "enable_filtering": false,
        "filter_type": "horizontal",
        "enable_sorting": false,
        "columns_mobile": "2",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "icorrect_product_grid_AAVQCj": {
      "type": "icorrect-product-grid",
      "name": "New Product Grid",
      "settings": {
        "padding-top": 50,
        "padding-bottom": 70,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#ffffff"
      }
    },
    "iphone_videos_GEpK4D": {
      "type": "iphone-videos",
      "name": "iPhone Videos",
      "settings": {
        "heading": "Behind the scenes",
        "subtitle": "Watch our videos to understand common repair issues, what to expect, and how we fix your device with care.",
        "video_1_title": "We specialise in data recovery.",
        "video_2_title": "Do not compromise on quality.",
        "video_3_title": "Poor quality parts cause serious issues.",
        "color_scheme": "scheme-4",
        "padding_top": 44,
        "padding_bottom": 80
      }
    },
    "repair_services_nQkwFT": {
      "type": "repair-services",
      "blocks": {
        "service_PEi9BF": {
          "type": "service",
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Walk-in.png",
            "heading": "Walk-In Service",
            "details": "For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.",
            "btn": "Learn more",
            "link": ""
          }
        },
        "service_RaggTi": {
          "type": "service",
          "disabled": true,
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Courier.png",
            "heading": "London Courier",
            "details": "We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.",
            "btn": "Learn more",
            "link": ""
          }
        },
        "service_enBGWD": {
          "type": "service",
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Delivery.png",
            "heading": "National Courier",
            "details": "We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.",
            "btn": "Learn more",
            "link": ""
          }
        }
      },
      "block_order": [
        "service_PEi9BF",
        "service_RaggTi",
        "service_enBGWD"
      ],
      "settings": {
        "padding-top": 50,
        "padding-bottom": 50,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#ffffff",
        "heading": "Our services",
        "details": "Choose the most convenient service for you"
      }
    },
    "iphone_faqs_Qh7fgn": {
      "type": "iphone-faqs",
      "blocks": {
        "accordion_xUtCPH": {
          "type": "accordion",
          "settings": {
            "heading": "How long do iPhone repairs take?",
            "sub_head": "<p>Most iPhone repairs are completed within 4 hours. That includes common faults like screen repairs, battery replacements, charging issues, and back glass damage.</p><p>If you’re in a rush, we offer an express service that can have your repair completed in as little as 1 to 2 hours. This is subject to availability, so we always recommend booking in advance.</p>",
            "alignment": "left"
          }
        },
        "accordion_4txNdq": {
          "type": "accordion",
          "settings": {
            "heading": "What warranty do you offer on iPhone repairs?",
            "sub_head": "<p>All of our iPhone repairs come with a two-year warranty covering any faults related to the repair. Whether it’s a screen replacement, battery repair, or logic board issue, we stand by the quality of our work.</p><p>The warranty doesn’t cover accidental damage or natural wear and tear, but if anything goes wrong due to the original fault, our team will sort it.</p>",
            "alignment": "left"
          }
        },
        "accordion_gUbHTg": {
          "type": "accordion",
          "settings": {
            "heading": "Do you use original parts?",
            "sub_head": "<p>Yes, we use original Apple parts for all iPhone repairs wherever possible. Most of our parts are carefully reclaimed from genuine Apple devices and tested in-house to confirm full functionality. If there’s any sign of wear or damage, we refurbish the part back to the original factory standard before using it in a repair.</p><p>This approach means your iPhone keeps key features like True Tone, battery health tracking, and long-term performance with no compatibility issues or feature loss.</p><p>We also believe this is the most sustainable way to repair. By reusing and refurbishing original Apple components, we avoid adding to the growing pile of electronic waste caused by unnecessary replacements. It’s a better outcome for your device, and a smarter one for the planet.</p>",
            "alignment": "left"
          }
        },
        "accordion_pGMtdF": {
          "type": "accordion",
          "settings": {
            "heading": "Will my iPhone show a “non-genuine” message after screen repair?",
            "sub_head": "<p>No, on devices running iOS 18 or later, we’re able to calibrate the screen directly through the settings so it’s recognised as a verified part. The iPhone just needs to be updated to the latest version of iOS.</p>",
            "alignment": "left"
          }
        },
        "accordion_xpjXDQ": {
          "type": "accordion",
          "settings": {
            "heading": "Can you repair iPhone logic boards?",
            "sub_head": "<p>Yes. This is one of our specialties. Logic board faults are often written off as unrepairable, especially by Apple and most high street repair shops. We take a different approach.</p><p>Our technicians work under a microscope at microchip level, repairing faults like power failures, charging issues, and internal connection damage. These issues often happen when the iPhone is dropped and the two layers of the logic board start to separate.</p><p>If your iPhone is not powering on, not charging, or has been declared “dead” by another repair centre, there’s still a good chance we can bring it back to life.</p>",
            "alignment": "left"
          }
        },
        "accordion_UPCrit": {
          "type": "accordion",
          "settings": {
            "heading": "Will battery health still show in settings after replacement?",
            "sub_head": "<p>Yes. All of our iPhone battery replacements support battery health monitoring in settings, so you can continue to track the performance and condition of your battery over time.</p><p>If we install a genuine Apple battery, your iPhone will recognise it as original, and you’ll see a message confirming the part as verified. On models where a genuine battery is no longer available, we use high-quality OEM replacements. These still show battery health in settings, but the message may not include Apple’s verification tag.</p><p>We’ll always tell you exactly what battery is being used and why. We only fit batteries that we’ve tested and approved, and we never use cheap or unstable parts that could cause long-term issues.</p>",
            "alignment": "left"
          }
        },
        "accordion_KYHPdQ": {
          "type": "accordion",
          "settings": {
            "heading": "Can you replace just the back glass on an iPhone?",
            "sub_head": "<p>It depends on the model. For iPhone 15 and newer (and also the iPhone 14 and 14 Plus), the back glass is modular. This makes it far more repair-friendly, and we can replace just the glass using a genuine part.</p><p>However, for most earlier models, including the iPhone 14 Pro and anything before it, the rear glass is fused to the frame. In these cases, the entire housing needs to be replaced to maintain structural integrity, wireless charging alignment, and proper waterproofing.</p><p>You may have seen cheaper back glass-only repairs offered for these older models, but the quality is poor and they tend to crack easily. It is always best to have an original part fitted, even if that means replacing the full housing.</p>",
            "alignment": "left"
          }
        },
        "accordion_kWxhfb": {
          "type": "accordion",
          "settings": {
            "heading": "Do you need my passcode for testing?",
            "sub_head": "<p>Yes, we do ask for your passcode so we can carry out full pre-repair and post-repair testing. This helps us check functions like Face ID, the camera, speaker, microphone, touchscreen response, and other key features before we return your device.</p><p>We do not access any personal apps, banking information, or private content. Our only goal is to confirm that everything is working as it should once the repair is complete.</p><p>If you prefer not to share your passcode, we can still carry out the repair. However, we will not be able to test the device fully, and in that case, the warranty will be limited to 30 days rather than our full two-year cover.</p>",
            "alignment": "left"
          }
        },
        "accordion_ptNrcT": {
          "type": "accordion",
          "settings": {
            "heading": "What’s included in your diagnostic process for iPhones?",
            "sub_head": "<p>If the fault is not obvious, we run a full diagnostic on your iPhone to work out exactly what has gone wrong. This includes checking power flow, charging function, logic board health, and all key components like the screen, battery, microphone, speakers, and sensors.</p><p>For more complex issues, especially those related to logic board damage, we inspect the board under a microscope and test individual circuits and chips to identify faults at microchip level.</p><p>Once we have confirmed the issue, we will send you a detailed report with a recommended repair plan and quote, so you know exactly what to expect before any work begins.</p>",
            "alignment": "left"
          }
        }
      },
      "block_order": [
        "accordion_xUtCPH",
        "accordion_4txNdq",
        "accordion_gUbHTg",
        "accordion_pGMtdF",
        "accordion_xpjXDQ",
        "accordion_UPCrit",
        "accordion_KYHPdQ",
        "accordion_kWxhfb",
        "accordion_ptNrcT"
      ],
      "name": "iPhone FAQs",
      "settings": {
        "padding-top": 50,
        "padding-bottom": 50,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#1D1D1F",
        "heading": "FAQs",
        "details": "Learn more about iCorrect, the essential iPhone repair services we offer and the warranties that come with each repair.",
        "txt-clr": "#FFFFFF"
      }
    },
    "contact_with_map_dXbbDU": {
      "type": "contact-with-map",
      "settings": {
        "map_html": "<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2482.7925117760165!2d-0.1422392230845079!3d51.51702250999988!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x48761b2c5aabf83b%3A0x2abbd489a9d66382!2siCorrect!5e0!3m2!1sen!2sit!4v1766495755523!5m2!1sen!2sit\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
        "address": "<h3>Address</h3><p>iCorrect 12 Margaret Street Fitzrovia London W1W 8JQ</p>",
        "form_heading": "Get in Touch",
        "form_subtitle": "Have a question about your device repair? We're here to help.",
        "section_bg": "#f4f4f4",
        "accent_color": "#3b82f6",
        "text_color": "#171717",
        "muted_text_color": "#6b7280",
        "input_bg": "#ffffff",
        "input_border": "#e5e7eb"
      }
    }
  },
  "order": [
    "banner",
    "product-grid",
    "icorrect_product_grid_AAVQCj",
    "iphone_videos_GEpK4D",
    "repair_services_nQkwFT",
    "iphone_faqs_Qh7fgn",
    "contact_with_map_dXbbDU"
  ]
}
