{"sections":{"banner":{"type":"main-collection-banner","disabled":true,"settings":{"show_collection_description":true,"show_collection_image":false,"color_scheme":"scheme-1"}},"product-grid":{"type":"main-collection-product-grid","disabled":true,"settings":{"products_per_page":16,"columns_desktop":4,"color_scheme":"scheme-1","image_ratio":"adapt","image_shape":"default","show_secondary_image":false,"show_vendor":false,"show_rating":false,"quick_add":"none","enable_filtering":true,"filter_type":"horizontal","enable_sorting":true,"columns_mobile":"2","padding_top":36,"padding_bottom":36}},"main_banner_and_video_HjbmW9":{"type":"main-banner-and-video","disabled":true,"settings":{"padding_top":0,"padding_bottom":0,"mob_padding_top":0,"mob_padding_bottom":0,"bg":"#ffffff","video_url":"","img":"shopify:\/\/shop_images\/Website-Banner.jpg"}},"about_info_RWbQxj":{"type":"about-info","name":"About Info","settings":{"padding_top":50,"padding_bottom":50,"mob_padding_top":40,"mob_padding_bottom":40,"bg":"#fafafa","heading":"MacBook Charging Port Repair Prices","details":"<p>If your MacBook has stopped charging, only powers on when the charger is angled a certain way, or does not detect power at all, the charging port may be worn, blocked, or damaged. This is one of the most common faults we see.<\/p><p><br\/>At iCorrect, we specialise in MacBook charging port repairs across both MacBook Air and MacBook Pro models. Whether your device uses MagSafe or USB-C, we carry out precision repairs using original components and factory-level techniques. Every charging port is tested for power draw, voltage stability, and thermal performance before we return the device to you.<\/p><p><br\/>If we find the fault goes beyond the charging port itself, we do not simply label it unrepairable or recommend a full logic board replacement. We go deeper, identifying the power delivery fault on the board and completing the repair at micro level when required. That is what sets us apart. We repair what others write off.<\/p>","btn":"","link":"","btn_2":"","link_2":"","heading_size_desktop":38,"heading_size_mobile":24,"heading_line_height_desktop":46,"heading_line_height_mobile":36}},"model_number_search_E6ekrC":{"type":"model-number-search","blocks":{"heading_Aj4z7g":{"type":"heading","settings":{"heading":"Need help identifying your MacBook?","heading_size":"h1"}},"text_JGVtrV":{"type":"text","settings":{"text":"<p>Check the model number printed on the underside of your MacBook. It starts with the letter “A” followed by four digits. Use this number to quickly identify your exact model and ensure you select the correct repair or service.<\/p>","text_style":"body"}}},"block_order":["heading_Aj4z7g","text_JGVtrV"],"name":"Model Number Search","settings":{"enable_model_search":true,"model_search_placeholder":"Enter model number, e.g. A3403","model_search_button_label":"Search","model_search_mode":"scroll","model_search_scope_selector":"#shopify-section-featured-collection, .featured-collection, .collection","height":"adapt","desktop_image_width":"small_medium","layout":"image_first","desktop_content_position":"top","desktop_content_alignment":"left","content_layout":"no-overlap","section_color_scheme":"","color_scheme":"","image_behavior":"none","mobile_content_alignment":"left","padding_top":36,"padding_bottom":36}},"featured_collection_AfhUDd":{"type":"featured-collection","name":"t:sections.featured-collection.presets.name","settings":{"title":"","heading_size":"h1","description":"","show_description":false,"description_style":"body","collection":"macbook-charging-port-repair-prices","columns_desktop":3,"full_width":false,"show_view_all":false,"view_all_style":"solid","enable_desktop_slider":false,"color_scheme":"scheme-1","image_ratio":"adapt","image_shape":"default","show_secondary_image":false,"show_vendor":false,"show_rating":false,"quick_add":"none","columns_mobile":"1","swipe_on_mobile":false,"padding_top":0,"padding_bottom":40}},"about_info_XAqnaH":{"type":"about-info","name":"About Info","settings":{"padding_top":50,"padding_bottom":50,"mob_padding_top":40,"mob_padding_bottom":40,"bg":"#fafafa","heading":"Our Process","details":"<p>Not every charging issue requires a new logic board. In fact, most MacBook charging problems come down to one of three causes: a worn charging port, damaged pins, or a fault within the power delivery circuit.<\/p><p><br\/>At iCorrect, we test all three as standard. This includes a full inspection of the port to check for signs of looseness, obstruction, corrosion, or shorting. If the fault runs deeper, we carry out diagnostic testing on the charging IC and surrounding components on the logic board itself. This is all done under a microscope by trained technicians.<\/p><p><br\/>Once the fault has been confirmed, we only replace what is necessary using original parts. We always verify the charging current and thermal profile following the repair. It is this level of precision that helps us resolve issues others miss, and why our charging port repairs last.<\/p>","btn":"","link":"","btn_2":"","link_2":"","heading_size_desktop":38,"heading_size_mobile":24,"heading_line_height_desktop":46,"heading_line_height_mobile":36}},"macbook_videos_yygcYB":{"type":"macbook-videos","name":"MacBook Videos","settings":{"heading":"See How We Repair Your MacBook","subtitle":"Watch our videos to see how we repair MacBooks, what to expect, and how we work.","video_1_title":"Repair is better than replace.","video_2_title":"Our repair approach is sustainable.","video_3_title":"Do not overpay for your repairs.","color_scheme":"scheme-4","padding_top":44,"padding_bottom":80}},"repair_services_nQkwFT":{"type":"repair-services","blocks":{"service_PEi9BF":{"type":"service","settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Walk-in.png","heading":"Walk-In Service","details":"For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.","btn":"Learn more","link":"shopify:\/\/pages\/our-services"}},"service_RaggTi":{"type":"service","disabled":true,"settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Courier.png","heading":"London Courier","details":"We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.","btn":"Learn more","link":""}},"service_enBGWD":{"type":"service","settings":{"icon":"shopify:\/\/shop_images\/Service_icon_Delivery.png","heading":"National Courier","details":"We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.","btn":"Learn more","link":"shopify:\/\/pages\/our-services"}}},"block_order":["service_PEi9BF","service_RaggTi","service_enBGWD"],"settings":{"padding-top":50,"padding-bottom":50,"mob-padding-top":40,"mob-padding-bottom":40,"bg":"#ffffff","heading":"Our services","details":"Choose the most convenient service for you"}},"video_reviews_83ReMa":{"type":"video-reviews","blocks":{"video_W74UiU":{"type":"video","settings":{"video":"","img":"shopify:\/\/shop_images\/Rectangle_2282.webp"}},"video_XGqbiC":{"type":"video","settings":{"video":"","img":"shopify:\/\/shop_images\/Rectangle_2284.webp"}},"video_weLpfR":{"type":"video","settings":{"video":"","img":"shopify:\/\/shop_images\/Rectangle_2283.webp"}}},"block_order":["video_W74UiU","video_XGqbiC","video_weLpfR"],"disabled":true,"settings":{"padding-top":80,"padding-bottom":80,"mob-padding-top":40,"mob-padding-bottom":80,"bg":"#121212","heading":"See what our clients have to say about us","facebook":"","facebook-icon":"shopify:\/\/shop_images\/fb-icon.png","insta":"","insta-icon":"shopify:\/\/shop_images\/insta-icon.png","tiktok":"","tiktok-icon":"shopify:\/\/shop_images\/tik-icon.png","youtube":"","youtube-icon":"shopify:\/\/shop_images\/utube-icon.png"}},"icorrect_faqs_RVk3VL":{"type":"icorrect-faqs","blocks":{"accordion_mCCjdt":{"type":"accordion","settings":{"heading":"How do I know if my MacBook charging port needs repair?","sub_head":"<p>There are a few common signs:<\/p><ul><li>Your MacBook only charges when the cable is angled or held in place<\/li><li>The charging LED on MagSafe models does not come on or behaves erratically<\/li><li>USB-C ports feel loose or do not grip the charger properly<\/li><li>Charging is slow, inconsistent, or fails to start<\/li><li>You have tested with another original charger and cable, and the issue remains<\/li><\/ul><p>If we suspect the port is not at fault, we carry out a power test using a high-precision ammeter. If the power is not passing through the port as expected, we carry out a full diagnostic to test the charging circuit, including the logic board and battery input, before we proceed.<\/p>","alignment":"left"}},"accordion_dgGrWD":{"type":"accordion","settings":{"heading":"How much does a MacBook charging port repair cost?","sub_head":"<p>Pricing starts at approximately £129, depending on your model and the type of port. Once we have inspected the device and confirmed that the issue is isolated to the charging port, we will provide a clear quote.<\/p><p>If the issue extends beyond the port itself, such as a board-level power fault or damage to the USB-C controller, we will upgrade the repair to a full diagnostic and quote accordingly. Unlike Apple, we do not replace the entire logic board unnecessarily. We repair at component level and always confirm the cost before starting any work.<\/p>","alignment":"left"}},"accordion_jNEQxe":{"type":"accordion","settings":{"heading":"Can you repair USB-C and MagSafe charging ports?","sub_head":"<p>Yes. We repair both USB-C and MagSafe charging ports across all MacBook Air and Pro models, from older Intel devices to the latest Apple silicon models.<\/p><p>MagSafe and USB-C ports operate on different charging circuits, but both route power directly into the logic board. We test the entire circuit during intake, confirm the fault, and complete the repair as required. USB-C ports are modular in most models but sit beneath the logic board, so we lift the board, replace the port, and verify the charging circuit before reassembly.<\/p><p>Whether the issue is physical damage, corrosion, or a deeper circuit-level fault, we will identify and resolve it.<\/p>","alignment":"left"}},"accordion_wzPFwd":{"type":"accordion","settings":{"heading":"How long does a MacBook charging port repair take?","sub_head":"<p>Most charging port repairs are completed within 2 to 3 working days. This includes intake testing, disassembly, the repair itself, recalibration of the charging profile, and full post-repair quality control.<\/p><p>If you need the device returned sooner, our express service may be available. This reduces the turnaround to 1 working day, depending on the model and the confirmed fault. Express bookings must be scheduled in advance and are subject to availability.<\/p>","alignment":"left"}},"accordion_rt4BjQ":{"type":"accordion","settings":{"heading":"Is it safe to repair a MacBook charging port?","sub_head":"<p>Yes, when repaired correctly.<\/p><p>We carry out all repairs using precision equipment under a microscope, with full anti-static precautions and the correct disassembly technique for your MacBook model. We do not force ports out or apply heat in ways that could damage the board, as seen in some TikTok teardown videos or Reddit threads from customers reporting failed repairs elsewhere.<\/p><p>Every repair is completed with proper flex routing, tension alignment, and resealing. Your data remains safe and your MacBook is returned fully intact.<\/p>","alignment":"left"}},"accordion_PLgEhN":{"type":"accordion","settings":{"heading":"What if the issue is not the charging port?","sub_head":"<p>We test this straight away. Using a high-accuracy power ammeter, we confirm whether power is entering and exiting the port as it should. If the port appears to be working correctly, we upgrade the repair to a full diagnostic and test the rest of the power circuit.<\/p><p>Power flows from the charger through the port into the logic board and battery. If any point in that path fails, including the USB-C controller, power management IC, or the battery itself, we will locate the fault and repair it at micro level.<\/p><p>Where most shops deem the device unrepairable or quote for an expensive board replacement, we repair the issue precisely and properly.<\/p>","alignment":"left"}},"accordion_wMHNen":{"type":"accordion","settings":{"heading":"How do I know if the issue is with my charger, not the MacBook?","sub_head":"<p>If you think the charger might be the problem, test the MacBook with another original Apple charger and cable. If the problem disappears, it is likely your charger at fault.<\/p><p>We frequently see power issues caused by third-party or imitation chargers. These can deliver unstable voltage, damage USB-C controllers, or short the logic board. If your MacBook started showing issues shortly after switching chargers, that is a likely cause.<\/p><p>When your device arrives, we test it with our own verified Apple chargers to confirm the fault before any work begins.<\/p>","alignment":"left"}},"accordion_heFyRm":{"type":"accordion","settings":{"heading":"Can a faulty charging port damage the logic board?","sub_head":"<p>Yes. The charging port is the first point of power contact with the system. If it is corroded, loose, or shorting internally, it can send irregular voltage into the logic board.<\/p><p>Over time, this can damage the USB-C ICs or other components responsible for power delivery and charging. The result is logic board instability, failure to charge, or no power conditions. Repairing the charging port early helps avoid far more serious issues later.<\/p>","alignment":"left"}},"accordion_7WpxcT":{"type":"accordion","settings":{"heading":"Do you offer a warranty on MacBook charging port repairs?","sub_head":"<p>Yes. All of our charging port repairs are covered by a two-year warranty, which includes any fault directly related to the part fitted or the workmanship.<\/p><p>This covers issues like failure to charge, reconnection faults, or poor contact. It does not cover accidental damage, liquid ingress, or issues caused by non-original chargers. If something goes wrong due to the repair itself, we will put it right.<\/p>","alignment":"left"}},"accordion_7BMWPU":{"type":"accordion","settings":{"heading":"Can you repair a charging port that has been damaged by liquid?","sub_head":"<p>Yes, but this will need to be handled as a liquid damage diagnostic. When liquid enters the charging port, it often affects more than just the connector. Nearby components and logic board circuitry may also be affected.<\/p><p>We treat liquid-damaged devices as full diagnostic cases. This means we will isolate any corrosion, clean and test the board thoroughly, and only return the MacBook once it has been restored to safe working order. If the device cannot be safely repaired, we will let you know why. In most cases, we can restore it fully.<\/p>","alignment":"left"}}},"block_order":["accordion_mCCjdt","accordion_dgGrWD","accordion_jNEQxe","accordion_wzPFwd","accordion_rt4BjQ","accordion_PLgEhN","accordion_wMHNen","accordion_heFyRm","accordion_7WpxcT","accordion_7BMWPU"],"settings":{"padding-top":50,"padding-bottom":75,"mob-padding-top":40,"mob-padding-bottom":40,"bg":"#1d1d1f","heading":"FAQs","details":"Learn more about iCorrect, the essential repair services that we offer and the warranties that come with each repair.","txt-clr":"#ffffff"}},"contact_with_map_dXbbDU":{"type":"contact-with-map","settings":{"address":"<h3>Address<\/h3><p>iCorrect\u202812 Margaret Street\u2028Fitzrovia\u2028London\u2028W1W 8JQ<\/p>"}}},"order":["banner","product-grid","main_banner_and_video_HjbmW9","about_info_RWbQxj","model_number_search_E6ekrC","featured_collection_AfhUDd","about_info_XAqnaH","macbook_videos_yygcYB","repair_services_nQkwFT","video_reviews_83ReMa","icorrect_faqs_RVk3VL","contact_with_map_dXbbDU"]}