/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "banner": {
      "type": "main-collection-banner",
      "disabled": true,
      "settings": {
        "show_collection_description": false,
        "show_collection_image": false,
        "color_scheme": "scheme-1"
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "disabled": true,
      "settings": {
        "products_per_page": 16,
        "columns_desktop": 4,
        "color_scheme": "scheme-1",
        "image_ratio": "adapt",
        "image_shape": "default",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": false,
        "quick_add": "none",
        "enable_filtering": false,
        "filter_type": "horizontal",
        "enable_sorting": false,
        "columns_mobile": "2",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "icorrect_product_grid_AAVQCj": {
      "type": "icorrect-product-grid",
      "name": "New Product Grid",
      "settings": {
        "padding-top": 50,
        "padding-bottom": 70,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#ffffff"
      }
    },
    "macbook_videos_BkK8G8": {
      "type": "macbook-videos",
      "name": "MacBook Videos",
      "settings": {
        "heading": "See How We Repair Your MacBook",
        "subtitle": "Watch our videos to see how we repair MacBooks, what to expect, and how we work.",
        "video_1_title": "Repair is better than replace.",
        "video_2_title": "Our repair approach is sustainable.",
        "video_3_title": "Do not overpay for your repairs.",
        "color_scheme": "scheme-4",
        "padding_top": 44,
        "padding_bottom": 80
      }
    },
    "repair_services_nQkwFT": {
      "type": "repair-services",
      "blocks": {
        "service_PEi9BF": {
          "type": "service",
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Walk-in.png",
            "heading": "Walk-In Service",
            "details": "For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.",
            "btn": "Learn more",
            "link": ""
          }
        },
        "service_RaggTi": {
          "type": "service",
          "disabled": true,
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Courier.png",
            "heading": "London Courier",
            "details": "We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.",
            "btn": "Learn more",
            "link": ""
          }
        },
        "service_enBGWD": {
          "type": "service",
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Delivery.png",
            "heading": "National Courier",
            "details": "We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.",
            "btn": "Learn more",
            "link": ""
          }
        }
      },
      "block_order": [
        "service_PEi9BF",
        "service_RaggTi",
        "service_enBGWD"
      ],
      "settings": {
        "padding-top": 50,
        "padding-bottom": 50,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#ffffff",
        "heading": "Our services",
        "details": "Choose the most convenient service for you"
      }
    },
    "macbook_faqs_kLL4Yp": {
      "type": "macbook-faqs",
      "blocks": {
        "accordion_JryaAc": {
          "type": "accordion",
          "settings": {
            "heading": "How long do MacBook repairs take?",
            "sub_head": "<p>Most MacBook repairs, including screen replacements, battery replacements, and keyboard repairs, take around 3 working days. If you need it done sooner, we offer an express MacBook repair service, allowing next day or same day repairs if booked in advance.</p>",
            "alignment": "left"
          }
        },
        "accordion_D4radV": {
          "type": "accordion",
          "settings": {
            "heading": "What warranty do you offer?",
            "sub_head": "<p>We provide a two year warranty on all MacBook repairs, covering issues related to the repair. Whether it is a screen replacement, battery repair, or logic board fix, our warranty ensures long term reliability. This does not cover accidental damage, but we are happy to help if any new issues arise.</p>",
            "alignment": "left"
          }
        },
        "accordion_rH46gN": {
          "type": "accordion",
          "settings": {
            "heading": "Do you use original parts?",
            "sub_head": "<p>Yes, around 90% of the parts we use are original Apple parts, disassembled from genuine Apple devices. We champion sustainable repairs, and reusing parts helps maintain Apple standards without creating unnecessary waste.</p><p>This approach means your MacBook retains features like True Tone, battery health monitoring, and the overall performance it was designed for after any repair at iCorrect.</p><p>The only exception is with older MacBook models, where it is no longer possible to source original batteries in high capacity condition. In those cases, we use the best quality OEM batteries available.</p>",
            "alignment": "left"
          }
        },
        "accordion_AU6KzL": {
          "type": "accordion",
          "settings": {
            "heading": "Do you repair damaged MacBook logic boards?",
            "sub_head": "<p>Yes, this is advanced work we are known for. While many repair centres, including Apple, will write off a faulty logic board and quote a full replacement, we repair them properly.</p><p>Our technicians work under a microscope, diagnosing issues at component and microchip level. That could mean anything from replacing a burned out MOSFET or shorted capacitor to rebuilding complete circuits after liquid damage. We revive boards others declare dead and we do it every day.</p><p>It is precise, delicate work, but it saves clients hundreds compared to Apple, keeps original data intact, and reduces electronic waste.</p><p>If Apple said your MacBook is not fixable and that you need a new one, there is a good chance we will prove them wrong.</p>",
            "alignment": "left"
          }
        },
        "accordion_JYJxAG": {
          "type": "accordion",
          "settings": {
            "heading": "What if my MacBook repair does not resolve the issue?",
            "sub_head": "<p>It is rare, but if a repair does not fully resolve the problem your MacBook has, we will not charge you for it. Our no fix, no fee policy applies to all standard MacBook repairs, and we will always explain what went wrong and what your options are.</p><p>In more advanced logic board diagnostics, if we are unsuccessful, we will suggest an alternative like a logic board replacement or data recovery, depending on what we find.</p><p>Either way, you will get a clear answer, not guesswork. No surprises.</p>",
            "alignment": "left"
          }
        },
        "accordion_QGAt4A": {
          "type": "accordion",
          "settings": {
            "heading": "Can I get my MacBook repaired quicker?",
            "sub_head": "<p>Yes, we offer an Express MacBook Repair Service for clients who need a faster turnaround. This service is limited and subject to availability, so booking in advance is recommended.</p><p>When pre booked, express repairs are often completed within one working day, and in some cases, even the same day. This applies to most issues, including screen, battery, and logic board repairs. Express bookings are prioritised and priced accordingly.</p>",
            "alignment": "left"
          }
        },
        "accordion_MndGEa": {
          "type": "accordion",
          "settings": {
            "heading": "What is your diagnostic process for MacBook repairs?",
            "sub_head": "<p>Diagnostics are where we do our best thinking. If the fault is not obvious, we run a full diagnostic on your MacBook, going deep into the logic board, charging system, and internal circuitry.</p><p>We perform a full power rail test and visual inspection under a microscope, looking for signs of damage at component level. That includes blown capacitors, corroded traces, and shorted chips. We then test each critical stage of the board to narrow down the fault.</p><p>Once we confirm the issue, we send a detailed report with a clear repair plan and quote so you are fully informed before any work begins.</p>",
            "alignment": "left"
          }
        },
        "accordion_HghCid": {
          "type": "accordion",
          "settings": {
            "heading": "Do you offer payment plans for MacBook repairs?",
            "sub_head": "<p>Yes, we offer flexible payment options through Klarna and PayPal Pay in 3. These let you spread the cost of your MacBook repair over time.</p><p>Both options are available at checkout for standard repairs. If you are sending your MacBook in for diagnostics, we will include the payment options with your quote once your MacBook repair plan is confirmed.</p>",
            "alignment": "left"
          }
        },
        "accordion_gY7AdY": {
          "type": "accordion",
          "settings": {
            "heading": "How do you ensure the quality of your MacBook repairs?",
            "sub_head": "<p>Every MacBook goes through multiple rounds of testing to make sure the repair is done right.</p><p>When a device arrives, we carry out a full intake check before it reaches the repair team. Once the repair begins, we run pre checks to confirm the fault and rule out any secondary issues. After the repair, your MacBook goes through full post repair testing and a final quality check completed by a technician who was not involved in the repair itself.</p><p>We also invest in ongoing training, and our technicians develop solutions for the latest MacBook issues, including faults Apple has not published repair procedures for yet.</p>",
            "alignment": "left"
          }
        },
        "accordion_Lcqz73": {
          "type": "accordion",
          "settings": {
            "heading": "Do you repair older MacBook models?",
            "sub_head": "<p>We mainly repair MacBook models from 2016 onwards, including both MacBook Air and MacBook Pro. For older models, especially those from 2015 and before, we can still help with things like battery replacements or data recovery.</p><p>We will be upfront if a repair does not make financial sense. If the cost outweighs the value of the device, we will recommend a more practical option.</p>",
            "alignment": "left"
          }
        }
      },
      "block_order": [
        "accordion_JryaAc",
        "accordion_D4radV",
        "accordion_rH46gN",
        "accordion_AU6KzL",
        "accordion_JYJxAG",
        "accordion_QGAt4A",
        "accordion_MndGEa",
        "accordion_HghCid",
        "accordion_gY7AdY",
        "accordion_Lcqz73"
      ],
      "name": "MacBook FAQs",
      "settings": {
        "padding-top": 50,
        "padding-bottom": 50,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#1d1d1f",
        "heading": "FAQs",
        "details": "Learn more about our MacBook repair service, parts, diagnostics, turnaround times, and warranty.",
        "txt-clr": "#ffffff"
      }
    },
    "contact_with_map_dXbbDU": {
      "type": "contact-with-map",
      "settings": {
        "padding-top": 0,
        "padding-bottom": 0,
        "mob-padding-top": 0,
        "mob-padding-bottom": 0,
        "bg": "#fafafa",
        "map": "shopify://shop_images/map-img.webp",
        "heading": "Get In Touch",
        "address": "<h3>Address</h3><p>iCorrect 12 Margaret Street Fitzrovia London W1W 8JQ</p>",
        "hours": "<h3>Hours</h3><p>Mon–Thur: 9am–6pm </p><p>Fri: 10am–6pm </p><p>Sat: Closed </p><p>Sun: Closed</p>"
      }
    }
  },
  "order": [
    "banner",
    "product-grid",
    "icorrect_product_grid_AAVQCj",
    "macbook_videos_BkK8G8",
    "repair_services_nQkwFT",
    "macbook_faqs_kLL4Yp",
    "contact_with_map_dXbbDU"
  ]
}
