/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "banner": {
      "type": "main-collection-banner",
      "disabled": true,
      "settings": {
        "show_collection_description": true,
        "show_collection_image": false,
        "color_scheme": "scheme-1"
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "disabled": true,
      "settings": {
        "products_per_page": 16,
        "columns_desktop": 4,
        "color_scheme": "scheme-1",
        "image_ratio": "adapt",
        "image_shape": "default",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": false,
        "quick_add": "none",
        "enable_filtering": true,
        "filter_type": "horizontal",
        "enable_sorting": true,
        "columns_mobile": "2",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "main_banner_and_video_HjbmW9": {
      "type": "main-banner-and-video",
      "disabled": true,
      "settings": {
        "padding_top": 0,
        "padding_bottom": 0,
        "mob_padding_top": 0,
        "mob_padding_bottom": 0,
        "bg": "#ffffff",
        "video_url": "",
        "img": "shopify://shop_images/Website-Banner.jpg"
      }
    },
    "about_info_RWbQxj": {
      "type": "about-info",
      "name": "About Info",
      "settings": {
        "padding_top": 50,
        "padding_bottom": 50,
        "mob_padding_top": 40,
        "mob_padding_bottom": 40,
        "bg": "#fafafa",
        "heading": "MacBook Trackpad Repair Prices",
        "details": "<p>If your MacBook trackpad has stopped clicking, is moving the cursor on its own, or no longer responds to touch, the issue is likely due to internal sensor failure. Trackpads are highly sensitive and sit directly above the battery, making them prone to pressure damage or faults caused by minor liquid exposure.</p><p><br/>At iCorrect, we specialise in MacBook trackpad replacements across all models, including the newer Apple silicon MacBooks. Every trackpad is tested for click response, gesture accuracy, and sensor integrity before and after repair. We only use original Apple parts, many of which are carefully reclaimed and tested in-house.</p><p><br/>Whether your issue was caused by a swollen battery, accidental impact, or a poor repair attempt elsewhere, we will confirm the root cause and restore full functionality to your device with the same quality standard Apple designed it to meet.</p>",
        "btn": "",
        "link": "",
        "btn_2": "",
        "link_2": "",
        "heading_size_desktop": 38,
        "heading_size_mobile": 24,
        "heading_line_height_desktop": 46,
        "heading_line_height_mobile": 36
      }
    },
    "model_number_search_q9ewCY": {
      "type": "model-number-search",
      "blocks": {
        "heading_DRif8j": {
          "type": "heading",
          "settings": {
            "heading": "Need help identifying your MacBook?",
            "heading_size": "h1"
          }
        },
        "text_wpMTDY": {
          "type": "text",
          "settings": {
            "text": "<p>Check the model number printed on the underside of your MacBook. It starts with the letter “A” followed by four digits. Use this number to quickly identify your exact model and ensure you select the correct repair or service.</p>",
            "text_style": "body"
          }
        }
      },
      "block_order": [
        "heading_DRif8j",
        "text_wpMTDY"
      ],
      "name": "Model Number Search",
      "settings": {
        "enable_model_search": true,
        "model_search_placeholder": "Enter model number, e.g. A3403",
        "model_search_button_label": "Search",
        "model_search_mode": "scroll",
        "model_search_scope_selector": "#shopify-section-featured-collection, .featured-collection, .collection",
        "height": "adapt",
        "desktop_image_width": "small_medium",
        "layout": "image_first",
        "desktop_content_position": "top",
        "desktop_content_alignment": "left",
        "content_layout": "no-overlap",
        "section_color_scheme": "",
        "color_scheme": "",
        "image_behavior": "none",
        "mobile_content_alignment": "left",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "featured_collection_AfhUDd": {
      "type": "featured-collection",
      "name": "t:sections.featured-collection.presets.name",
      "settings": {
        "title": "",
        "heading_size": "h1",
        "description": "",
        "show_description": false,
        "description_style": "body",
        "collection": "macbook-trackpad-repair-prices",
        "columns_desktop": 3,
        "full_width": false,
        "show_view_all": false,
        "view_all_style": "solid",
        "enable_desktop_slider": false,
        "color_scheme": "scheme-1",
        "image_ratio": "adapt",
        "image_shape": "default",
        "show_secondary_image": false,
        "show_vendor": false,
        "show_rating": false,
        "quick_add": "none",
        "columns_mobile": "1",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "macbook_videos_e88WFU": {
      "type": "macbook-videos",
      "name": "MacBook Videos",
      "settings": {
        "heading": "See How We Repair Your MacBook",
        "subtitle": "Watch our videos to see how we repair MacBooks, what to expect, and how we work.",
        "video_1_title": "Repair is better than replace.",
        "video_2_title": "Our repair approach is sustainable.",
        "video_3_title": "Do not overpay for your repairs.",
        "color_scheme": "scheme-4",
        "padding_top": 44,
        "padding_bottom": 80
      }
    },
    "about_info_XAqnaH": {
      "type": "about-info",
      "name": "About Info",
      "settings": {
        "padding_top": 50,
        "padding_bottom": 50,
        "mob_padding_top": 40,
        "mob_padding_bottom": 40,
        "bg": "#fafafa",
        "heading": "Our Process",
        "details": "<p>Trackpad faults are often misdiagnosed. If the cursor is jumping around, gestures are not registering, or the device registers phantom clicks, the problem could be the trackpad, the battery, or a circuit-level fault shared with the keyboard.</p><p><br/>At iCorrect, we do not guess. We test the full input system. That includes inspecting the trackpad, battery, and internal cabling under the logic board. If liquid is present, we upgrade the job to a diagnostic to make sure the logic board and connected circuits are safe.</p><p><br/>Once confirmed, we replace only what is necessary using original parts. Every trackpad is pressure-tested and quality-checked before the device is returned. If something does not feel right to us, it does not leave the workshop.</p>",
        "btn": "",
        "link": "",
        "btn_2": "",
        "link_2": "",
        "heading_size_desktop": 38,
        "heading_size_mobile": 24,
        "heading_line_height_desktop": 46,
        "heading_line_height_mobile": 36
      }
    },
    "repair_services_nQkwFT": {
      "type": "repair-services",
      "blocks": {
        "service_PEi9BF": {
          "type": "service",
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Walk-in.png",
            "heading": "Walk-In Service",
            "details": "For clients based in Central London who wish to visit us, we operate a  walk-in drop-off service by appointment. Simply book your repair via our  website booking page to confirm your appointment time before heading to us.",
            "btn": "Learn more",
            "link": "shopify://pages/our-services"
          }
        },
        "service_RaggTi": {
          "type": "service",
          "disabled": true,
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Courier.png",
            "heading": "London Courier",
            "details": "We operate a convenient collection, repair & delivery service for  clients based within Zones 1 & 2 in London. Our couriers are fully  tracked and insured throughout the journey. Book your iPhone repair  before 1pm for a same day return.",
            "btn": "Learn more",
            "link": ""
          }
        },
        "service_enBGWD": {
          "type": "service",
          "settings": {
            "icon": "shopify://shop_images/Service_icon_Delivery.png",
            "heading": "National Courier",
            "details": "We collect from anywhere in the UK. Book online and we send secure packaging to your door. Your device is returned fully repaired and tested.",
            "btn": "Learn more",
            "link": "shopify://pages/our-services"
          }
        }
      },
      "block_order": [
        "service_PEi9BF",
        "service_RaggTi",
        "service_enBGWD"
      ],
      "settings": {
        "padding-top": 50,
        "padding-bottom": 50,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#ffffff",
        "heading": "Our services",
        "details": "Choose the most convenient service for you"
      }
    },
    "icorrect_faqs_RVk3VL": {
      "type": "icorrect-faqs",
      "blocks": {
        "accordion_mCCjdt": {
          "type": "accordion",
          "settings": {
            "heading": "Why is my MacBook trackpad not clicking or responding properly?",
            "sub_head": "<p>This usually comes down to light liquid damage or sensor failure. The trackpad is a pressure-sensitive plate that uses a series of sensors beneath the surface to detect clicks and movement. If those sensors are exposed to moisture, even in small amounts, they can become unresponsive or fail entirely.</p><p>It is also possible that the fault lies within the circuit shared with the keyboard. If that part of the board is affected, it can stop the trackpad from working properly. We test the full input system before confirming the repair needed.</p>",
            "alignment": "left"
          }
        },
        "accordion_dgGrWD": {
          "type": "accordion",
          "settings": {
            "heading": "Can you fix a MacBook trackpad that is clicking by itself or moving the cursor randomly?",
            "sub_head": "<p>Yes. These symptoms are usually caused by trackpad sensors registering phantom input, which means the system thinks you are touching the trackpad when you are not.</p><p>This can be caused by sensor failure, liquid ingress, or even pressure issues due to a swelling battery. In most cases, we resolve this with a trackpad replacement. We test every device beforehand to confirm the exact cause.</p>",
            "alignment": "left"
          }
        },
        "accordion_jNEQxe": {
          "type": "accordion",
          "settings": {
            "heading": "How much does a MacBook trackpad repair cost?",
            "sub_head": "<p>Trackpad repairs at iCorrect start from £159, depending on your MacBook model. Once we inspect the MacBook and confirm the fault, we will provide a fixed quote before any repair begins.</p><p>We only use original Apple parts, and every repair includes full testing, reassembly, and a two-year warranty.</p>",
            "alignment": "left"
          }
        },
        "accordion_wzPFwd": {
          "type": "accordion",
          "settings": {
            "heading": "Do you repair the existing trackpad, or replace it?",
            "sub_head": "<p>In almost all cases, the correct approach is to replace the trackpad. Because it is a pressure-sensitive sensor pad, physical damage or liquid exposure often causes internal failure that cannot be reliably repaired.</p><p>If the fault is due to a single visible micro component, and we are confident we can complete the repair to the same standard, we may proceed with a component-level fix. However, we normally recommend full replacement to guarantee performance and reliability.</p>",
            "alignment": "left"
          }
        },
        "accordion_rt4BjQ": {
          "type": "accordion",
          "settings": {
            "heading": "Can a swollen battery affect the trackpad?",
            "sub_head": "<p>Yes. The trackpad sits directly above the battery, and when a battery swells, it can push up against the back of the trackpad, making clicks harder or preventing them entirely.</p><p>If your MacBook is not clicking properly, and the battery is also showing signs of swelling or failure, there is a good chance the battery is affecting the trackpad’s performance. We inspect both before confirming which part needs replacing.</p>",
            "alignment": "left"
          }
        },
        "accordion_PLgEhN": {
          "type": "accordion",
          "settings": {
            "heading": "My trackpad stopped working after a keyboard or battery repair. Can you help?",
            "sub_head": "<p>Yes, and this happens more often than it should. The keyboard and trackpad are linked on the same input circuit. If one is repaired without proper post-repair testing, it is easy to miss secondary issues.</p><p>We see this after keyboard replacements and battery swaps completed by third-party shops or DIY repairs. If a connector was left loose or a cable was damaged during reassembly, the trackpad may stop working. We test the full circuit and confirm the cause before we begin any repair.</p>",
            "alignment": "left"
          }
        },
        "accordion_wMHNen": {
          "type": "accordion",
          "settings": {
            "heading": "Will the new trackpad feel the same as the original?",
            "sub_head": "<p>Yes. We use only original Apple trackpads, often reclaimed from donor MacBooks and tested in-house. These parts retain the same click feel, gesture sensitivity, and feedback as your original part.</p><p>We run full pressure and functionality tests on every replacement. If it does not respond like the original, it is not approved.</p>",
            "alignment": "left"
          }
        },
        "accordion_heFyRm": {
          "type": "accordion",
          "settings": {
            "heading": "Can you repair trackpads on newer M1 and M2 MacBooks?",
            "sub_head": "<p>Yes. We repair all MacBook models, including the latest M1, M2, and beyond. There are small differences between generations, even when the outer design looks identical. For example, the M1 and M2 13-inch MacBook Pro models use slightly different trackpad part numbers.</p><p>We identify and match the correct part for your machine based on serial and model reference. Our repairs preserve original functionality and feel.</p>",
            "alignment": "left"
          }
        },
        "accordion_7WpxcT": {
          "type": "accordion",
          "settings": {
            "heading": "Do you offer a warranty on MacBook trackpad repairs?",
            "sub_head": "<p>Yes. All trackpad repairs come with our standard two-year warranty, which covers any fault related to the repair, the part fitted, or any workmanship involved.</p><p>If you notice any issue following the repair, we will inspect and resolve it as part of that cover. We log the full repair process so we know exactly what was done and what was tested.</p>",
            "alignment": "left"
          }
        },
        "accordion_7BMWPU": {
          "type": "accordion",
          "settings": {
            "heading": "Can a faulty trackpad damage other parts of the MacBook?",
            "sub_head": "<p>Not directly, but it can be a sign of deeper damage. The trackpad and keyboard share input lines, and both are connected to the logic board. If liquid enters through the trackpad or keyboard, it can affect those circuits.</p><p>Think of the internal system like a motorway. The trackpad and keyboard are separate vehicles using the same lanes. If one breaks down, it can block the other. If both are affected, it is usually due to damage on the route they share. We always test both to confirm the full repair needed.</p>",
            "alignment": "left"
          }
        }
      },
      "block_order": [
        "accordion_mCCjdt",
        "accordion_dgGrWD",
        "accordion_jNEQxe",
        "accordion_wzPFwd",
        "accordion_rt4BjQ",
        "accordion_PLgEhN",
        "accordion_wMHNen",
        "accordion_heFyRm",
        "accordion_7WpxcT",
        "accordion_7BMWPU"
      ],
      "settings": {
        "padding-top": 50,
        "padding-bottom": 75,
        "mob-padding-top": 40,
        "mob-padding-bottom": 40,
        "bg": "#1d1d1f",
        "heading": "FAQs",
        "details": "Learn more about iCorrect, the essential repair services that we offer and the warranties that come with each repair.",
        "txt-clr": "#ffffff"
      }
    },
    "contact_with_map_dXbbDU": {
      "type": "contact-with-map",
      "settings": {
        "address": "<h3>Address</h3><p>iCorrect 12 Margaret Street Fitzrovia London W1W 8JQ</p>"
      }
    }
  },
  "order": [
    "banner",
    "product-grid",
    "main_banner_and_video_HjbmW9",
    "about_info_RWbQxj",
    "model_number_search_q9ewCY",
    "featured_collection_AfhUDd",
    "about_info_XAqnaH",
    "macbook_videos_e88WFU",
    "repair_services_nQkwFT",
    "icorrect_faqs_RVk3VL",
    "contact_with_map_dXbbDU"
  ]
}
