/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "image_with_text_y7QzJY": {
      "type": "image-with-text",
      "blocks": {
        "heading_WMVgRT": {
          "type": "heading",
          "settings": {
            "heading": "<strong>Apple Watch Repair Specialists</strong>",
            "heading_size": "h1"
          }
        },
        "text_3mchpk": {
          "type": "text",
          "settings": {
            "text": "<p>At iCorrect, we specialise in advanced Apple Watch repairs carried out with the same precision and standards found in factory-level service. Our team handles OLED display assemblies, glass-only repairs, batteries, charging issues, sensor faults, and diagnostic assessments for every Apple Watch series. Most repairs are completed within 48 hours.</p>",
            "text_style": "body"
          }
        },
        "button_FmcYa6": {
          "type": "button",
          "disabled": true,
          "settings": {
            "button_label": "View Our Services",
            "button_link": "shopify://collections/apple-watch-repair-prices",
            "button_style_secondary": false
          }
        }
      },
      "block_order": [
        "heading_WMVgRT",
        "text_3mchpk",
        "button_FmcYa6"
      ],
      "name": "t:sections.image-with-text.presets.name",
      "settings": {
        "image": "shopify://shop_images/Apple_Watch_Repair.png",
        "height": "small",
        "desktop_image_width": "medium",
        "layout": "text_first",
        "desktop_content_position": "middle",
        "desktop_content_alignment": "center",
        "content_layout": "no-overlap",
        "section_color_scheme": "scheme-1",
        "color_scheme": "scheme-2",
        "image_behavior": "none",
        "mobile_content_alignment": "center",
        "padding_top": 36,
        "padding_bottom": 0
      }
    },
    "rich_text_YRKr4q": {
      "type": "rich-text",
      "blocks": {
        "heading_wp7DCT": {
          "type": "heading",
          "settings": {
            "heading": "<strong>Apple Watch Repair Services in the UK</strong>",
            "heading_size": "h1"
          }
        },
        "text_wEearp": {
          "type": "text",
          "settings": {
            "text": "<p>At iCorrect, we specialise in Apple Watch repair services across all series. Whether the fault is a damaged OLED display, cracked glass, weakened battery, charging issue, failing sensor, or a software-related malfunction, every repair is carried out by technicians trained to work on compact, highly integrated hardware. </p><p>With years of experience restoring thousands of Apple Watches, our process is built on precision, consistency, and clear communication. Every watch is fully tested before and after repair to confirm proper functionality, and all Apple Watch repairs include a <strong>2-year warranty</strong> for complete peace of mind.</p>"
          }
        }
      },
      "block_order": [
        "heading_wp7DCT",
        "text_wEearp"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "center",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 92,
        "padding_bottom": 0
      }
    },
    "custom_liquid_DmTYFc": {
      "type": "custom-liquid",
      "name": "Repairs",
      "settings": {
        "custom_liquid": "<style>\n/* ---------- WATCH REPAIR CATEGORIES ---------- */\n.repair-categories {\n  max-width: 950px;\n  margin: 0 auto 80px auto;\n}\n\n.repair-category {\n  background: #ebecf0;\n  border-radius: 12px;\n  padding: 35px;\n  margin-bottom: 30px;\n  border-left: 5px solid #111;\n}\n\n.repair-category h3 {\n  font-size: 26px;\n  margin-bottom: 14px;\n}\n\n.repair-category p,\n.repair-category li {\n  font-size: 16px;\n  line-height: 1.65;\n  color: #555;\n}\n\n.repair-link {\n  display: inline-block;\n  background:#111;\n  color:#fff !important;\n  padding: 12px 28px;\n  border-radius: 6px;\n  margin-top: 14px;\n  font-weight: 600;\n}\n</style>\n\n<section id=\"repair-categories\" class=\"repair-categories\">\n\n<!-- DISPLAY (OLED) -->\n<div class=\"repair-category\">\n<h3>Apple Watch Display (OLED) Repair</h3>\n<p>The Apple Watch OLED display is a sophisticated component that combines the touch-sensitive glass, OLED panel, and digitizer in a single assembly. When damaged, the entire display assembly requires replacement to restore your Apple Watch to full functionality.</p>\n\n<p><strong>Display issues we repair:</strong></p>\n<ul>\n<li>Cracked or shattered display glass from impacts or drops</li>\n<li>OLED screen damage showing lines, dead pixels, or colour issues</li>\n<li>Completely black or unresponsive screen</li>\n<li>Touch functionality not working or registering incorrect inputs</li>\n<li>Display separation or lifting from the watch body</li>\n<li>Backlight issues or dim display</li>\n<li>Green line or other display artifacts</li>\n</ul>\n\n<p>We use genuine OLED displays that match original specifications for brightness, colour accuracy, and touch sensitivity. Our technicians carefully install the new display and test all functions including Force Touch, Digital Crown responsiveness, and display quality before returning your watch.</p>\n\nView Display Repair Pricing →\n</div>\n\n<!-- GLASS ONLY -->\n<div class=\"repair-category\">\n<h3>Apple Watch Screen Glass Replacement</h3>\n<p>If your Apple Watch has surface cracks or scratches on the protective glass but the OLED display underneath is functioning normally, glass-only replacement may be a viable repair option, though this is highly dependent on the extent of damage and watch model.</p>\n\n<p><strong>Glass repair considerations:</strong></p>\n<ul>\n<li>Surface scratches and minor cracks that don't affect display function</li>\n<li>Sapphire crystal replacement for premium models (Stainless Steel, Titanium, Edition)</li>\n<li>Ion-X glass replacement for aluminium models</li>\n<li>Chipped or damaged edges of the protective glass</li>\n<li>Cracks that haven't penetrated to the OLED layer</li>\n</ul>\n\n<p>It's important to note that due to the Apple Watch's integrated design, glass-only repairs aren't always possible. In many cases, especially with significant cracks or when the digitizer is affected, complete display assembly replacement is necessary. During our diagnostic, we'll assess your specific watch and recommend the most appropriate and cost-effective repair solution. For sapphire crystal models, we use genuine sapphire replacements to maintain the premium scratch resistance.</p>\n\nView Screen Glass Pricing →\n</div>\n\n<!-- BATTERY -->\n<div class=\"repair-category\">\n<h3>Apple Watch Battery Replacement</h3>\n<p>Apple Watch batteries degrade over time, reducing battery life and device performance. If your Apple Watch no longer lasts through the day on a single charge, our battery replacement service restores full battery capacity and performance.</p>\n\n<p><strong>Signs you need an Apple Watch battery replacement:</strong></p>\n<ul>\n<li>Watch requires charging multiple times per day with normal use</li>\n<li>Battery drains rapidly even in low power mode</li>\n<li>Watch shuts down unexpectedly despite showing charge remaining</li>\n<li>Slow or inconsistent charging behaviour</li>\n<li>Watch only works when on the charger</li>\n<li>Swollen battery causing display lifting or back case separation</li>\n<li>Overheating during charging or regular wear</li>\n<li>Watch is 2–3+ years old and battery life has noticeably degraded</li>\n</ul>\n\n<p>Apple Watch battery replacement is a delicate procedure due to the compact design and adhesive securing the battery. Our technicians use specialised tools to safely remove the old battery without damaging other components, then install a gebnuine replacement battery. All battery replacements include proper re-sealing to maintain water resistance and comprehensive testing to ensure optimal performance and charging.</p>\n\nView Battery Replacement Pricing →\n</div>\n\n<!-- DIAGNOSTIC -->\n<div class=\"repair-category\">\n<h3>Apple Watch Diagnostic Service</h3>\n<p>Not sure what's causing your Apple Watch issues? Our detailed diagnostic service identifies all hardware and software problems, providing you with a comprehensive assessment and transparent repair recommendations.</p>\n\n<p><strong>Our Apple Watch diagnostic service includes:</strong></p>\n<ul>\n<li>Complete hardware functionality testing (display, battery, sensors, buttons)</li>\n<li>Digital Crown and side button operation testing</li>\n<li>Taptic Engine (haptic feedback) evaluation</li>\n<li>Heart rate sensor, ECG, and blood oxygen sensor testing (where applicable)</li>\n<li>Charging system and wireless charging coil inspection</li>\n<li>Water damage assessment and moisture detection</li>\n<li>Bluetooth and Wi-Fi connectivity testing</li>\n<li>Detailed report with transparent pricing for required repairs</li>\n</ul>\n\n<p>We explain all issues clearly and provide honest advice about whether repair is worthwhile or if replacement might be more economical. Whether your Apple Watch won't turn on, isn't charging, or is experiencing sensor problems, our diagnostic service identifies the exact cause and provides you with the information you need to make an informed decision.</p>\n\nView Diagnostic Service →\n</div>\n\n</section>",
        "color_scheme": "",
        "padding_top": 52,
        "padding_bottom": 0
      }
    },
    "apple_watch_videos_ABzYkW": {
      "type": "apple-watch-videos",
      "name": "Apple Watch Videos",
      "settings": {
        "heading": "See Our Apple Watch Repair Videos",
        "subtitle": "Watch our videos to understand common repair issues, what to expect, and how we fix your device with care.",
        "video_1_title": "Repair your Watch, don't replace it.",
        "video_2_title": "Treat your rear glass with care.",
        "video_3_title": "We care about sustainability.",
        "color_scheme": "scheme-4",
        "padding_top": 40,
        "padding_bottom": 80
      }
    },
    "custom_liquid_g7nppQ": {
      "type": "custom-liquid",
      "name": "FAQs",
      "settings": {
        "custom_liquid": "<style>\n.faq-section {\n  background:#ebecf0;\n  max-width: 950px;\n  margin: 0 auto 70px auto;\n  padding:50px 30px;\n  border-radius:14px;\n}\n.faq-section h2 {\n  text-align:center;\n  font-size:34px;\n  margin-bottom:40px;\n}\n.faq-item {\n  background:#fff;\n  padding:22px;\n  border-left:4px solid #111;\n  border-radius:8px;\n  margin-bottom:20px;\n}\n.faq-item h3 {\n  font-size:19px;\n  margin-bottom:10px;\n}\n</style>\n\n<section class=\"faq-section\">\n<h2>Apple Watch Repair FAQs</h2>\n\n<div class=\"faq-item\">\n<h3>How long does an Apple Watch repair take?</h3>\n<p>Most Apple Watch repairs are completed within three working days.</p>\n<p>If you need your device back sooner, we offer a next-day turnaround for selected repairs through our Express Service. Same-day repair is not possible, as we use a curing process to reseal the watch and retain its liquid resistance. That adhesive takes time to set properly and we don’t cut corners.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>What warranty do you provide on Apple Watch repairs?</h3>\n<p>All of our Apple Watch repairs come with a two-year warranty covering any fault related to the repair. That includes issues with the glass, touch response, and display.</p>\n<p>We reseal every watch using liquid-resistant adhesive to match the original seal. This helps protect against day-to-day exposure to water, like washing hands or wearing the watch in the shower.</p>\n<p>However, like Apple, we do not cover accidental water damage. If the watch is not locked properly before swimming or diving, water can still get in and this kind of misuse wouldn’t be covered under warranty.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>What is the difference between a glass-only repair and a full display replacement?</h3>\n<p>If your Apple Watch still shows a clear display underneath the cracked glass, and the touch is working properly, we can usually complete a glass-only repair. This retains your original display and helps keep costs down.</p>\n<p>If the display has stopped working, shows lines, or the touch response is lost, you’ll need a full display replacement. This includes both the glass and the OLED screen beneath it.</p>\n<p>Not sure which one you need? We’ll confirm as soon as we’ve inspected your watch.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>Will my Apple Watch be water resistant after repair?</h3>\n<p>Yes, we reseal every Apple Watch using liquid-resistant adhesive that’s equivalent to Apple’s original seal. This helps maintain the same level of water resistance your device had before the damage.</p>\n<p>Your watch will be protected for everyday use including hand washing, light rain, or wearing it in the shower. However, no Apple Watch is fully waterproof. Activities like swimming, especially in the sea or at depth, can still allow water in if the watch is not locked properly.</p>\n<p>For best results, we always recommend enabling Water Lock before using your watch in water.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>My glass is broken and the touch is not working. Which repair do I need?</h3>\n<p>If the glass is cracked and the touch is no longer responding, you’ll need a full display replacement.</p>\n<p>This repair includes both the front glass and the OLED display beneath it. It’s the best option when the screen is damaged beyond just the surface layer, and it ensures your Apple Watch is fully functional again.</p>\n<p>We’ll test everything during our intake checks and confirm the exact fault before starting any work.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>Will Apple Pay still work after repair?</h3>\n<p>Yes, absolutely.</p>\n<p>We retain the original NFC chip during both glass-only and full display repairs, which means Apple Pay will continue to work exactly as it did before. Your Apple Watch will still pair, sync, and tap-to-pay without any issues.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>Do you use original parts for Apple Watch repairs?</h3>\n<p>Yes. Wherever possible, we use original Apple Watch parts that have been carefully disassembled from genuine devices.</p>\n<p>This approach allows us to retain the original quality and functionality, from touch sensitivity to Apple Pay and waterproofing. Every part is inspected, tested, and cleaned before use, so you get the same performance as you would from a brand new component.</p>\n<p>It also helps reduce waste by giving high-quality parts a second life, rather than letting them end up in landfill.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>Why are your Watch repair costs cheaper than Apple?</h3>\n<p>Because at iCorrect we repair. Apple replace.</p>\n<p>At the Apple Store, even for a small fault like cracked glass on an Apple Watch, they’ll replace the entire device with a reconditioned unit and charge you for it. That’s their default process.</p>\n<p>At iCorrect, we fix the actual fault. Whether it’s just the glass or a full display, we repair what’s needed and nothing more. That’s why our prices are often significantly lower, without compromising on quality.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>Will my ECG and heart rate monitor still work after the repair?</h3>\n<p>Yes, both features will continue to work as normal after your repair.</p>\n<p>We use original parts and follow Apple’s design standards, which means sensors like ECG and the heart rate monitor remain fully functional. We also test these features during our final quality checks to make sure everything is working before we return your watch.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3>Can you repair Apple Watch logic boards or water damage?</h3>\n<p>Unfortunately, no. We don’t repair Apple Watch logic boards or water-damaged internal components.</p>\n<p>These types of faults require full board-level replacement, and the cost to complete that type of repair would often outweigh the value of the watch itself. In cases like this, we’ll always be upfront and help you decide whether it’s worth repairing or replacing the device.</p>\n</div>\n\n</section>",
        "color_scheme": "",
        "padding_top": 0,
        "padding_bottom": 0
      }
    },
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "padding_top": 0,
        "padding_bottom": 28
      }
    }
  },
  "order": [
    "image_with_text_y7QzJY",
    "rich_text_YRKr4q",
    "custom_liquid_DmTYFc",
    "apple_watch_videos_ABzYkW",
    "custom_liquid_g7nppQ",
    "main"
  ]
}
