/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "image_with_text_y7QzJY": {
      "type": "image-with-text",
      "blocks": {
        "heading_WMVgRT": {
          "type": "heading",
          "settings": {
            "heading": "<strong>iPad Repair Specialists</strong>",
            "heading_size": "h1"
          }
        },
        "text_3mchpk": {
          "type": "text",
          "settings": {
            "text": "<p>At iCorrect, we specialise in advanced iPad repairs carried out to original factory standards. Our team handles screen replacements, glass-only repairs, batteries, charging issues, liquid damage, and logic board failures. Average turnaround is three working days, with express options available for selected models.</p>",
            "text_style": "body"
          }
        },
        "button_FmcYa6": {
          "type": "button",
          "disabled": true,
          "settings": {
            "button_label": "View Our Services",
            "button_link": "shopify://collections/ipad-repair-prices",
            "button_style_secondary": false
          }
        }
      },
      "block_order": [
        "heading_WMVgRT",
        "text_3mchpk",
        "button_FmcYa6"
      ],
      "name": "t:sections.image-with-text.presets.name",
      "settings": {
        "image": "shopify://shop_images/iPad_Repair.png",
        "height": "adapt",
        "desktop_image_width": "medium",
        "layout": "text_first",
        "desktop_content_position": "middle",
        "desktop_content_alignment": "center",
        "content_layout": "no-overlap",
        "section_color_scheme": "scheme-1",
        "color_scheme": "scheme-2",
        "image_behavior": "none",
        "mobile_content_alignment": "center",
        "padding_top": 36,
        "padding_bottom": 0
      }
    },
    "rich_text_YRKr4q": {
      "type": "rich-text",
      "blocks": {
        "heading_wp7DCT": {
          "type": "heading",
          "settings": {
            "heading": "<strong>iPad Repair Services in the UK</strong>",
            "heading_size": "h1"
          }
        },
        "text_wEearp": {
          "type": "text",
          "settings": {
            "text": "<p>Whether you’ve damaged the screen, need a new battery, or are dealing with charging faults, our technicians handle every repair with precision using high-quality parts. iPads are essential tools for work, learning, and creativity, so we offer express repair options for selected models, including same-day turnaround when pre-booked.</p><p>With over a decade of experience restoring thousands of iPads, we’ve built our reputation on technical expertise, transparent pricing, and consistent service. All our iPad repairs come with a 2-year warranty for complete peace of mind.</p>"
          }
        }
      },
      "block_order": [
        "heading_wp7DCT",
        "text_wEearp"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "center",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 92,
        "padding_bottom": 0
      }
    },
    "custom_liquid_LDPqPq": {
      "type": "custom-liquid",
      "name": "Repairs",
      "settings": {
        "custom_liquid": "<style>\n.repair-categories {\n  max-width: 950px;\n  margin: 0 auto 80px auto;\n}\n\n.repair-category {\n  background: #f8f9fa;\n  border-radius: 12px;\n  padding: 35px;\n  margin-bottom: 30px;\n  border-left: 5px solid #111;\n}\n\n.repair-category h3 {\n  font-size: 26px;\n  margin-bottom: 14px;\n}\n\n.repair-category p,\n.repair-category li {\n  font-size: 16px;\n  line-height: 1.65;\n  color: #555;\n}\n\n.repair-link {\n  display: inline-block;\n  background:#111;\n  color:#fff !important;\n  padding: 12px 28px;\n  border-radius: 6px;\n  margin-top: 10px;\n  font-weight: 600;\n}\n\n@media (max-width: 900px) {\n  .repair-category { padding: 25px 20px; }\n}\n</style>\n\n<section id=\"repair-categories\" class=\"repair-categories\">\n\n<div class=\"repair-category\">\n<h3>iPad LCD Replacement</h3>\n<p>LCD faults affect display performance even when the glass appears intact. If your iPad shows lines, black spots, no display, or severe flickering, the LCD requires replacement.</p>\n<p><strong>Common LCD issues we fix:</strong></p>\n<ul>\n<li>iPad turns on but shows no image</li>\n<li>Vertical or horizontal lines across the screen</li>\n<li>Severe colour distortion, dark patches, or flicker</li>\n<li>Ink-bleed or pressure marks under the glass</li>\n</ul>\n<p>We use genuine LCDs, ensuring brightness, colour accuracy, and pixel density remain as expected. in the models where the the screen is laminated (LCD and digitiser are fused togwether), we also make sure that the Apple Pencil works as it should after the repair.</p>\nView LCD Repair Pricing →\n</div>\n\n<div class=\"repair-category\">\n<h3>iPad Screen (Glass-Only) Repair</h3>\n<p>Glass-only repairs apply to models where the touchscreen digitiser is separate from the LCD panel. If the image is fine but the top glass is cracked, this is the correct repair.</p>\n<p><strong>Common symptoms:</strong></p>\n<ul>\n<li>Cracked or shattered front glass</li>\n<li>Touch input issues on specific areas</li>\n<li>Ghost touches or delayed response</li>\n<li>Glass lifting from the frame</li>\n</ul>\n<p>We carefully remove the damaged glass, replace it with a high-quality digitiser, and fully test touch accuracy and responsiveness - including Apple Pencil!.</p>\nView Glass Repair Pricing →\n</div>\n\n<div class=\"repair-category\">\n<h3>iPad Battery Replacement</h3>\n<p>iPad batteries degrade over time, especially on heavily used or older models. Worn batteries cause performance dips, unexpected shutdowns, or swelling.</p>\n<p><strong>Signs you need a new battery:</strong></p>\n<ul>\n<li>iPad drains unusually fast</li>\n<li>Random shutdowns even above 20%</li>\n<li>Battery swelling pushing up the screen</li>\n<li>iPad only turns on when connected to a charger</li>\n<li>Overheating during normal use or charging</li>\n</ul>\n<p>We safely remove the original adhesive-bonded battery and install a fresh replacement, followed by a full charging and performance test.</p>\nView Battery Pricing →\n</div>\n\n<div class=\"repair-category\">\n<h3>iPad Charging Port Repair</h3>\n<p>If your iPad is no longer charging, charging intermittently, or fails to connect to accessories, the charging port may be damaged or obstructed.</p>\n<p><strong>Charging issues we solve:</strong></p>\n<ul>\n<li>Loose or unreliable charging connection</li>\n<li>iPad not charging at all</li>\n<li>Slow charging or “Not charging” message</li>\n<li>Corroded or bent port pins</li>\n</ul>\n<p>We repair or replace the charging port and test charging speed and cable stability after the repair.</p>\nView Charging Port Pricing →\n</div>\n\n<div class=\"repair-category\">\n<h3>iPad Diagnostic Service</h3>\n<p>If you're unsure what the issue is, our diagnostic service isolates the fault. We perform hardware checks, software analysis, and component testing to identify the exact cause of the problem.</p>\n<p><strong>Our diagnostic includes:</strong></p>\n<ul>\n<li>Touchscreen, LCD, and battery testing</li>\n<li>Charging system and power-line checks</li>\n<li>Logic board assessment and liquid damage inspection</li>\n<li>Connectivity testing (Wi-Fi, Bluetooth, cellular)</li>\n</ul>\n<p>Once complete, we provide a full breakdown of findings and repair recommendations before proceeding.</p>\nBook Diagnostic Service →\n</div>\n\n</section>",
        "color_scheme": "",
        "padding_top": 52,
        "padding_bottom": 0
      }
    },
    "ipad_videos_G99Lmy": {
      "type": "ipad-videos",
      "name": "iPad Videos",
      "settings": {
        "heading": "See Our iPad Repair Videos",
        "subtitle": "Watch our videos to understand common repair issues, what to expect, and how we fix your device with care.",
        "video_1_title": "Your Pencil will work after the repair.",
        "video_2_title": "We repair what Apple can't.",
        "video_3_title": "We can bring your iPad back to life.",
        "color_scheme": "scheme-4",
        "padding_top": 40,
        "padding_bottom": 80
      }
    },
    "custom_liquid_nikTgq": {
      "type": "custom-liquid",
      "name": "FAQs",
      "settings": {
        "custom_liquid": "<style>\n.faq-section {\n  background:#f8f9fa;\n  max-width: 950px;\n  margin: 0 auto 70px auto;\n  padding:50px 30px;\n  border-radius:14px;\n}\n\n.faq-section h2 {\n  text-align:center;\n  font-size:34px;\n  margin-bottom:40px;\n}\n\n.faq-item {\n  background:#fff;\n  padding:22px;\n  border-left:4px solid #111;\n  border-radius:8px;\n  margin-bottom:20px;\n}\n\n.faq-item h3 {\n  font-size:19px;\n  margin-bottom:10px;\n}\n\n@media (max-width: 900px) {\n  .faq-section { padding: 35px 18px; }\n}\n</style>\n\n<section class=\"faq-section\">\n<h2>iPad Repair FAQs</h2>\n\n<div class=\"faq-item\">\n<h3><strong>How long do iPad repairs take?</strong></h3>\n<p>Most iPad repairs are completed within three working days. This includes screen repairs, battery replacements, and internal faults.</p>\n<p>If you need your iPad repaired faster, we offer an express service for selected models. When booked in advance, express repairs can often be completed within one working day, depending on the fault and part availability.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>What warranty do you offer on iPad repairs?</strong></h3>\n<p>All of our iPad repairs come with a two-year warranty that covers any fault related to the repair. Whether it’s a screen replacement, battery issue, or logic board repair, we stand by the quality of our work.</p>\n<p>The warranty does not cover accidental damage or natural wear and tear, but if anything goes wrong because of the original fault, we’ll sort it.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Do iPad repairs void my Apple warranty?</strong></h3>\n<p>Technically, yes. As soon as the screen is broken or the housing is damaged, your iPad is already considered out of warranty by Apple.</p>\n<p>Apple does not offer repairs for iPads. Instead, they replace the entire device with a reconditioned unit and charge you for it. That’s why many clients choose to repair with us. We restore your original iPad using original parts, often for less than half the cost of Apple's replacement quote.</p>\n<p>Because we use original parts, Apple may still choose to service the device later at their discretion. But to be clear, once it’s damaged, the warranty is no longer valid either way.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>How much does it cost to repair an iPad compared to Apple?</strong></h3>\n<p>Apple doesn’t actually repair iPads. Instead, they offer a full-device replacement with a reconditioned unit, which often costs in the region of £500 (or more), even for older models.</p>\n<p>At iCorrect, we repair your original iPad using genuine parts wherever possible. That means if you’ve only damaged the screen or battery, we can fix just that part, without replacing the whole device.</p>\n<p>Our average iPad screen repair is around half the cost of Apple’s replacement service. It’s better for your device, better for the environment, and better for your wallet.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Can you repair just the glass on an iPad screen?</strong></h3>\n<p>Yes, in many cases we can repair just the glass on your iPad — but it depends on the model.</p>\n<p>Standard iPads have a separate glass and LCD, which makes glass-only repairs more straightforward. For iPad Pro and Air models, the glass and display are fused together, which makes the process more complex but still possible. We offer both options depending on the damage and the model.</p>\n<p>If you’re unsure which type of screen your iPad has, we’ll confirm once we assess the device and talk you through the repair options.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Do you use original parts for iPad repairs?</strong></h3>\n<p>Yes, we use original Apple parts for all current iPad models wherever they are available. Most of our parts are reclaimed from genuine Apple devices and tested in-house before being used in any repair.</p>\n<p>For older models where original parts are no longer available, we use the highest quality OEM replacements. These are carefully sourced, fully tested, and chosen to match Apple’s performance standards as closely as possible.</p>\n<p>We’ll always tell you what part is being used, and why. No surprises, no cutting corners.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Can you fix Touch ID or Face ID on an iPad?</strong></h3>\n<p>Unfortunately, we do not offer repairs for Touch ID or Face ID on iPads. Apple have not released replacement parts for these components, and both features are serialised to the original logic board for security reasons.</p>\n<p>If either has stopped working, we can run diagnostics to confirm the cause, but if the sensor itself is damaged, it cannot be replaced or restored without Apple’s internal tools.</p>\n<p>We’ll always be honest about what's possible and help you explore your options if these features are no longer functioning.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Will my Apple Pencil still work after a repair?</strong></h3>\n<p>Yes, your Apple Pencil will continue to work exactly as it should after the repair.</p>\n<p>Because we use original parts and complete the repair to factory standards, features like Pencil pairing and pressure sensitivity remain fully functional. We also test Apple Pencil functionality before completing the repair to make sure everything is working as expected.</p>\n<p>In fact, we were one of the first companies to solve serialisation issues with Apple Pencil pairing, so you’re in safe hands.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>How do you open iPads if they don’t have screws?</strong></h3>\n<p>iPads are sealed using a strong adhesive around the edge of the screen, which is why there are no visible screws.</p>\n<p>To open the device, we use a controlled heating process to soften the adhesive, followed by precision tools to lift the screen without damaging the internal components. Once the repair is complete, we reseal the screen using an adhesive that matches the strength of the original maintaining the structure, fit, and finish Apple intended.</p>\n<p>It’s a delicate process, but we’ve perfected it over years of working with every iPad model.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Can you repair logic board issues or water damage on an iPad?</strong></h3>\n<p>Yes, we can. Our team specialises in microchip-level iPad repairs, including complex logic board faults and water damage, the kind of issues that Apple and most shops will simply write off.</p>\n<p>We carry out a full diagnostic to assess the extent of the damage. From there, we’ll either repair the affected circuits directly or rebuild sections of the board if needed. These are delicate repairs done under a microscope, but they’re often the difference between saving your iPad and replacing it entirely.</p>\n</div>\n\n</section>",
        "color_scheme": "",
        "padding_top": 0,
        "padding_bottom": 0
      }
    },
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "padding_top": 0,
        "padding_bottom": 28
      }
    }
  },
  "order": [
    "image_with_text_y7QzJY",
    "rich_text_YRKr4q",
    "custom_liquid_LDPqPq",
    "ipad_videos_G99Lmy",
    "custom_liquid_nikTgq",
    "main"
  ]
}
