{"sections": {"image_with_text_y7QzJY": {"type": "image-with-text","blocks": {"heading_WMVgRT": {"type": "heading","settings": {"heading": "<strong>iPhone Repair Specialists</strong>","heading_size": "h1"}},"text_3mchpk": {"type": "text","settings": {"text": "<p>At iCorrect, we specialise in advanced microchip-level iPhone repairs. We aim to repair to original factory standards. Our team handles screens, batteries, charging issues, liquid damage and logic board failures. Average turnaround: just 2 to 4 hours.</p>","text_style": "body"}},"button_FmcYa6": {"type": "button","disabled": true,"settings": {"button_label": "View Our Services","button_link": "shopify://collections/iphone-repair-prices","button_style_secondary": false}}},"block_order": ["heading_WMVgRT","text_3mchpk","button_FmcYa6"],"name": "t:sections.image-with-text.presets.name","settings": {"image": "shopify://shop_images/iPhone_Repair.png","height": "adapt","desktop_image_width": "medium","layout": "text_first","desktop_content_position": "middle","desktop_content_alignment": "center","content_layout": "no-overlap","section_color_scheme": "scheme-1","color_scheme": "scheme-2","image_behavior": "none","mobile_content_alignment": "center","padding_top": 36,"padding_bottom": 0}},"rich_text_YRKr4q": {"type": "rich-text","blocks": {"heading_wp7DCT": {"type": "heading","settings": {"heading": "<strong>iPhone Repair Services in the UK</strong>","heading_size": "h1"}},"text_wEearp": {"type": "text","settings": {"text": "<p>Whether you've cracked your screen, need a battery replacement, or are experiencing charging issues, our skilled technicians provide fast, reliable repairs using high-quality parts. We understand how essential your iPhone is to your daily life, which is why we offer <strong>same-day</strong> and while-you-wait repair options for most common issues.</p><p>With over a decade of experience repairing thousands of iPhones, we've built our reputation on quality workmanship, transparent pricing, and exceptional customer service. All our iPhone repairs come with a <strong>2-year warranty</strong>, giving you complete peace of mind.</p>"}}},"block_order": ["heading_wp7DCT","text_wEearp"],"name": "t:sections.rich-text.presets.name","settings": {"desktop_content_position": "center","content_alignment": "center","color_scheme": "","full_width": true,"padding_top": 92,"padding_bottom": 0}},"custom_liquid_enXATM": {"type": "custom-liquid","name": "Repairs","settings": {"custom_liquid": "<style>\n.repair-categories {\n  max-width: 950px;\n  margin: 0 auto 80px auto;\n}\n\n.repair-category {\n  background: #f8f9fa;\n  border-radius: 12px;\n  padding: 35px;\n  margin-bottom: 30px;\n  border-left: 5px solid #111;\n}\n\n.repair-category h3 {\n  font-size: 26px;\n  margin-bottom: 14px;\n}\n\n.repair-category p,\n.repair-category li {\n  font-size: 16px;\n  line-height: 1.65;\n  color: #555;\n}\n\n.repair-link {\n  display: inline-block;\n  background:#111;\n  color:#fff !important;\n  padding: 12px 28px;\n  border-radius: 6px;\n  margin-top: 10px;\n  font-weight: 600;\n}\n\n@media (max-width: 900px) {\n  .repair-category { padding: 25px 20px; }\n}\n</style>\n\n<section class=\"repair-categories\" id=\"repair-categories\">\n\n<div class=\"repair-category\">\n<h3>iPhone Screen Repair &amp; Replacement</h3>\n<p>A cracked or shattered iPhone screen is one of the most common issues we repair. Our screen replacement service restores your iPhone to perfect working condition using premium-quality LCD and OLED displays that match original specifications.</p>\n<p><strong>Common screen issues we fix:</strong></p>\n<ul>\n<li>Cracked or shattered glass from drops and impacts</li>\n<li>Non-responsive or malfunctioning touchscreen (ghost touches, dead zones)</li>\n<li>LCD damage causing display lines, black spots, or discolouration<br></li>\n<li>Screen separation or lifting from the frame</li>\n</ul>\n<p>We stock genuine-quality replacement screens for all iPhone models and can typically complete screen repairs within 2 hours. All screen replacements include thorough testing of touch responsiveness, Face ID functionality, and True Tone display calibration where applicable.</p>\n<a class=\"repair-link\" href=\"/collections/iphone-screen-repair-prices\">View Screen Repair Pricing →</a>\n</div>\n\n<div class=\"repair-category\">\n<h3>iPhone Battery Replacement</h3>\n<p>Is your iPhone battery draining quickly, shutting down unexpectedly, or not holding a charge? We offer professional battery replacement services using genuine Apple batteries for most models.</p>\n<p><strong>Signs you need a battery replacement:</strong></p>\n<ul>\n<li>Battery drains faster than 20% per hour with normal use</li>\n<li>iPhone shuts down unexpectedly, especially below 30% charge</li>\n<li>Battery Health showing below 80% capacity in Settings</li>\n<li>Phone only works when connected to charger</li>\n<li>Swollen or expanded battery causing screen lifting</li>\n<li>Overheating during charging or regular use</li>\n</ul>\n<p>Our battery replacement service includes proper disposal of your old battery, installation of a brand new replacement, and full post-repair test to ensure optimal performance. Most battery replacements are completed within 2 hours.</p>\n<a class=\"repair-link\" href=\"/collections/iphone-battery-repair-prices\">View Battery Replacement Pricing →</a>\n</div>\n\n<div class=\"repair-category\">\n<h3>iPhone Charging Port Repair</h3>\n<p>Charging port issues can prevent your iPhone from charging properly or connecting to accessories. We repair or replace faulty charging ports, restoring full functionality to your device.</p>\n<p><strong>Charging port problems we resolve:</strong></p>\n<ul>\n<li>iPhone not charging or only charging at certain angles</li>\n<li>Loose or wobbly charging cable connection</li>\n<li>Lint, debris inside the charging port</li>\n<li>Bent or broken charging port pins<br></li>\n<li>CarPlay or data transfer not working via cable</li>\n</ul>\n<p>We use original charging port assemblies and test all functions including charging speed, data transfer, and audio output to ensure everything works perfectly.</p>\n<a class=\"repair-link\" href=\"/collections/iphone-charging-port-repair-prices\">View Charging Port Repair Pricing →</a>\n</div>\n\n<div class=\"repair-category\">\n<h3>iPhone Housing &amp; Rear Glass Repair</h3>\n<p>Damaged housing or rear glass doesn't just affect your iPhone's appearance—it can compromise structural integrity and water resistance. We offer professional housing and back glass replacement services.</p>\n<p><strong>Housing and rear glass repairs include:</strong></p>\n<ul>\n<li>Cracked or shattered rear glass panel replacement</li>\n<li>Bent or damaged chassis straightening or replacement</li>\n<li>Camera lens glass replacement</li>\n<li>Dented or scratched housing restoration</li>\n<li>Complete housing transplant for severely damaged devices</li>\n<li>Restoration of water resistance seals where possible</li>\n</ul>\n<p>For iPhone models with glass backs (iPhone 8 and newer), rear glass replacement requires specialised equipment and expertise. Our technicians carefully transfer all components to a pristine genuine housing, ensuring your iPhone looks and functions like new.</p>\n<a class=\"repair-link\" href=\"/collections/iphone-rear-housing-repair-prices\">View Housing Repair Pricing →</a>\n</div>\n\n<div class=\"repair-category\">\n<h3>iPhone Diagnostic Service</h3>\n<p>Not sure what's wrong with your iPhone? Our comprehensive diagnostic service identifies all hardware and software issues, providing you with a detailed report and repair recommendations.</p>\n<p><strong>Our diagnostic service covers:</strong></p>\n<ul>\n<li>Complete hardware component testing (screen, battery, cameras, sensors)</li>\n<li>Software and iOS troubleshooting</li>\n<li>Water damage assessment and corrosion inspection<br></li>\n<li>Connectivity testing (Wi-Fi, Bluetooth, cellular signal)</li>\n<li>Audio system evaluation (speakers, microphones, earpiece)</li>\n<li>Detailed written report with repair cost estimates</li>\n</ul>\n<p>We'll explain every issue in plain English and provide transparent pricing before any work begins, so you can make an informed decision about your iPhone repair.</p>\n<a class=\"repair-link\" href=\"/collections/iphone-diagnostic-prices\">Book Diagnostic Service →</a>\n</div>\n\n</section>","color_scheme": "","padding_top": 52,"padding_bottom": 0}},"iphone_videos_FAhKbH": {"type": "iphone-videos","name": "iPhone Videos","settings": {"heading": "See How We Repair Your iPhone","subtitle": "Watch our videos to understand common repair issues, what to expect, and how we fix your device with care.","video_1_title": "We specialise in data recovery.","video_2_title": "Do not compromise on quality.","video_3_title": "Poor quality parts cause serious issues.","color_scheme": "scheme-4","padding_top": 40,"padding_bottom": 80}},"custom_liquid_MX7Wdd": {"type": "custom-liquid","name": "FAQs","settings": {"custom_liquid": "<style>\n.faq-section {\n  background:#f8f9fa;\n  max-width: 950px;\n  margin: 0 auto 70px auto;\n  padding:50px 30px;\n  border-radius:14px;\n}\n\n.faq-section h2 {\n  text-align:center;\n  font-size:34px;\n  margin-bottom:40px;\n}\n\n.faq-item {\n  background:#fff;\n  padding:22px;\n  border-left:4px solid #111;\n  border-radius:8px;\n  margin-bottom:20px;\n}\n\n.faq-item h3 {\n  font-size:19px;\n  margin-bottom:10px;\n}\n</style>\n\n<section class=\"faq-section\">\n<h2>iPhone Repair FAQs</h2>\n\n<div class=\"faq-item\">\n<h3><strong>How long does an iPhone repair take?</strong></h3>\n<p>Most common iPhone repairs, such as screen replacements and battery changes, are completed within 2 hours. Diagnostics can take up to 2 working days. We always provide an estimated completion time when you book your repair, and we'll notify you immediately if we discover any additional issues that might extend the repair time.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Do you offer same-day iPhone repair services?</strong></h3>\n<p>Yes! We offer same-day repair services for most iPhone issues at our London office. For screen repairs, battery replacements, and charging port fixes, we typically complete repairs the same day you bring your device in—often within two hours. For more complex repairs or mail-in services, we aim to complete and return your iPhone within 2-4 working days. Contact us to check availability for your specific repair and location.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Will my iPhone repair come with a warranty?</strong></h3>\n<p>Absolutely. All our iPhone repairs include a comprehensive warranty covering both parts and labour. All our repairs, from modular component replacements to logic board repairs, come with a 2-year warranty. If you experience any issues with your repair during the warranty period, we'll fix it free of charge. Our warranty demonstrates our confidence in the quality of our workmanship and the premium parts we use.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Do you use genuine Apple parts for iPhone repairs?</strong></h3>\n<p>While we're not an Apple Authorised Service Provider, over 90% of our parts is genuine and sourced from trusted suppliers to confirm perfect functionality and originality. All parts come with warranties and are thoroughly tested before installation.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Can you repair liquid-damaged iPhones?</strong></h3>\n<p>Yes, we specialise in liquid damage restoration for iPhones. Our process includes ultrasonic cleaning of the logic board, corrosion removal, component-level diagnostics, and replacement of any damaged parts. Success rates vary depending on how quickly you bring in your device and the severity of the damage. We recommend not attempting to charge or power on a water-damaged iPhone—bring it to us as soon as possible for the best chance of recovery. </p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>What iPhone models do you repair?</strong></h3>\n<p>Our technicians are trained on all generations of iPhones and we maintain a comprehensive parts inventory for both current and legacy models. Whether you have an iPhone 11, iPhone 13 Pro, an iPhone 16 Pro Max or any other model, we have the expertise and parts to complete your repair professionally.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>How much does iPhone screen repair cost?</strong></h3>\n<p>iPhone screen repair costs vary depending on your specific model. Older models typically cost less to repair (~£100), while newer models with OLED displays cost more (£250-£400). We provide transparent, upfront pricing with no hidden fees. Visit our screen repair pricing page or contact us with your iPhone model for an exact quote. All screen repairs include a 2-year warranty.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Will I lose my data during the iPhone repair?</strong></h3>\n<p>In most cases, no. Repairs like screen replacements, battery changes, and charging port fixes don't affect your data at all. However, we always recommend backing up your iPhone before any repair as a precautionary measure. For logic board repairs or more complex issues, there's a possibility of data loss, which we'll discuss with you upfront. We never intentionally erase or access your data—your privacy and security are our top priorities.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Can you fix my iPhone if the screen is completely black?</strong></h3>\n<p>Black screens with the device still running are often caused by a failed display, but they can also stem from battery faults or connection issues. Our diagnostic assessment isolates the exact cause. If the display is at fault, we replace it; if the issue is power-related or due to a loose connection, we address that instead. Once assessed, we confirm the findings and the most effective repair to bring the iPhone back to normal operation.</p>\n</div>\n\n<div class=\"faq-item\">\n<h3><strong>Do I need to book an appointment for iPhone repair?</strong></h3>\n<p>While walk-ins are welcome at our London office, we recommend booking an appointment to ensure minimal waiting time and guaranteed same-day service. Booking ahead allows us to allocate a technician and reserve the necessary parts for your specific iPhone model. You can book online through our website, call us directly, or message us on WhatsApp and Instagram/Facebook. For urgent repairs, contact us and we'll do our best to accommodate you as quickly as possible, even without an appointment.</p>\n</div>\n\n</section>","color_scheme": "scheme-1","padding_top": 0,"padding_bottom": 0}},"main": {"type": "main-page","disabled": true,"settings": {"padding_top": 0,"padding_bottom": 28}}},"order": ["image_with_text_y7QzJY","rich_text_YRKr4q","custom_liquid_enXATM","iphone_videos_FAhKbH","custom_liquid_MX7Wdd","main"]}